#!/usr/bin/env python
# -*- coding: utf-8 -*-

__author__ = 'ipetrash'


# http://lurkmore.to/Язык_падонков
#
# # Учитезь правильна гаваридь! Урок 1.
# http://h.ua/story/79874/
#
# https://ru.wikipedia.org/wiki/Жаргон_падонков


text = """Конечно, там еще много работы. Нужно корректно переводить слова с несколькими значениями, улучшать перевод
разных форм глаголов, сделать настраиваемый уровень перевода для разных уровней владения английским, готовить
упражнения для запоминания новых слов. Этим я буду заниматься на досуге в ближайшие месяцы. """

print(text)
