[
    {
        "title": "Сезон 1",
        "url": "http://online-south-park.ru/season-1/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-01.jpg",
        "episodes": [
            {
                "title": "1 сезон 1 серия: Картман и анальный зонд",
                "url": "http://online-south-park.ru/season-1/239-1-sezon-1-seriya-kartman-i-analnyy-zond.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1437987302_0.jpg",
                "description": "Самая первая \"Южного парка\". Инопланетяне вставляют Картману анальный зонд и похищают брата Кайла."
            },
            {
                "title": "1 сезон 2 серия: Набор веса 4000",
                "url": "http://online-south-park.ru/season-1/240-1-sezon-2-seriya-nabor-vesa-4000.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1437990707_1.jpg",
                "description": "В Саут-Парк приезжает Кэти Ли Гиффорд, чтобы вручить Эрику награду за победу на конкурсе эссе. Мистер Гаррисон, узнав о приезде звезды, начинает волноваться, вспоминая неприятный случай из детства. Картман же, узнав, что его покажут по телевидению, просит мать купить ему гейнер, который используют бодибилдеры для набора массы. Вот только без упражнений Эрик обречён набирать жир."
            },
            {
                "title": "1 сезон 3 серия: Вулкан",
                "url": "http://online-south-park.ru/season-1/241-1-sezon-3-seriya-vulkan.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1438080335_1.jpg",
                "description": "Ребята отправляются на охоту в горы с дядей Джимбо и Недом. Им угрожает опасность, ведь местный вулкан начнёт извергаться с минуты на минуту."
            },
            {
                "title": "1 сезон 4 серия: Большой Эл-гомосек и его гомояхта",
                "url": "http://online-south-park.ru/season-1/242-1-sezon-4-seriya-bolshoy-el-gomosek-i-ego-gomoyahta.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1438081710_1.jpg",
                "description": "Стэн показывает друзьям свою новую собаку Спарки. Оказывается, что этот пёс - гей. Все, кроме Стэна, смеются над ним. Стэн же пытается превратить пса в натурала. Вскоре собака сбегает, и Стэн отправляется на поиски своего пса-гея."
            },
            {
                "title": "1 сезон 5 серия: Слон занимается любовью со свиньёй",
                "url": "http://online-south-park.ru/season-1/247-1-sezon-5-seriya-slon-zanimaetsya-lyubovyu-so-sviney.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-08/1439213284_1.jpg",
                "description": "Кайл решает завести слона в качестве домашнего животного, но его родители против. Тогда ему приходит в голову мысль скрестить слона со свиньёй, чтобы получить маленьких домашних слоников..."
            },
            {
                "title": "1 сезон 6 серия: Смерть",
                "url": "http://online-south-park.ru/season-1/243-1-sezon-6-seriya-smert.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1438255719_1.jpg",
                "description": "Дедушка Стэна просит своего внука убить его, поскольку ему уже надоело жить. Тем временем родители добиваются запрета шоу Терренса и Филлипа."
            },
            {
                "title": "1 сезон 7 серия: Конъюнктивит",
                "url": "http://online-south-park.ru/season-1/244-1-sezon-7-seriya-konyunktivit.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1438265070_1.jpg",
                "description": "Первая страшная \"хэллоуинская\" серия \"Южного парка\". На Кенни падает и убивает его космическая станция. В морге по ошибке в него вместо бальзамической жидкости заливают Ворчестерширский соус. В результате Кенни превращается в зомби и начинает кусать людей..."
            },
            {
                "title": "1 сезон 8 серия: Дэмиен",
                "url": "http://online-south-park.ru/season-1/248-1-sezon-8-seriya-demien.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-08/1439214424_1.jpg",
                "description": "Мистер Гаррисон знакомит детей с новым учеником. Его зовут Дэмиен и он... сын Сатаны. Дэмиен достаточно агрессивный и злой, но все одноклассники стараются подружиться с ним и настроены дружелюбно.\nИисус, узнав о появлении сына Сатаны, спешит пообщаться с ним. Вскоре между Сатаной и Иисусом будет боксёрский поединок."
            },
            {
                "title": "1 сезон 9 серия: Кошмарный Марвин",
                "url": "http://online-south-park.ru/season-1/249-1-sezon-9-seriya-koshmarnyy-marvin.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-08/1439456111_1.jpg",
                "description": "Ребята отправляют пожертвование голодающим африканским жителям. Сделали они это не просто так, а в надежде получить подарок. Вскоре им действительно приходит посылка. Вот только там не часы, о которых они мечтали, а тощий африканский мальчик по имени Марвин...\nТем временем на Южный парк нападают индейки."
            },
            {
                "title": "1 сезон 10 серия: Мистер Хэнки, рождественская какашка",
                "url": "http://online-south-park.ru/season-1/250-1-sezon-10-seriya-mister-henki-rozhdestvenskaya-kakashka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-08/1439465519_0.jpg",
                "description": "Под Рождество многие жители Саут-Парка протестуют против различных элементов праздника. Каждый считает, что тот или иной элемент оскорбляет его чувства. В итоге Рождество под угрозой срыва. Кайл буквально предлагает заменить Иисуса на мистера Хэнки, рождественскую какашку, чтобы устроить политкорректное Рождество. Но выясняется, что мистера Хэнки видит только он один. Вскоре Кайла отправляют в психушку по этому поводу."
            },
            {
                "title": "1 сезон 11 серия: Ринопластическая клиника Тома",
                "url": "http://online-south-park.ru/season-1/252-1-sezon-11-seriya-rinoplasticheskaya-klinika-toma.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-08/1440070465_1.jpg",
                "description": "Мистер Гаррисон сообщает, что некоторое время не сможет преподавать, поскольку ему будут делать пластическую операцию на носу. Операция проходит успешно, и Гаррисон получает совершенно новое лицо.\nА на замену Гаррисону ученикам ставят новую учительницу - мисс Эллен. Все мальчики мгновенно влюбляются в неё. Венди начинает ревновать Стэна к ней."
            },
            {
                "title": "1 сезон 12 серия: Меха-Стрейзанд",
                "url": "http://online-south-park.ru/season-1/253-1-sezon-12-seriya-meha-streyzand.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-08/1440072720_1.jpg",
                "description": "Картман находит странный треугольный камень, но, посчитав, что камень не представляет ничего ценного, выбрасывает его. Кайл забирает себе этот камень. На самом деле этот камень является половиной алмаза, который даёт огромную силу. Барбра Стрейзанд давно охотится за второй половиной. Узнав, что камень находится у мальчика из Саут-Парка, она спешит в этот город."
            },
            {
                "title": "1 сезон 13 серия: Мамаша Картмана — грязная шлюха",
                "url": "http://online-south-park.ru/season-1/254-1-sezon-13-seriya-mamasha-kartmana-gryaznaya-shlyuha.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-09/1441195582_1.jpg",
                "description": "Стэн, Кайл и Кенни сняли видео, на котором Картман устроил чаепитие с игрушками. Они считают, что это не нормально и решают показать это видео школьному психологу. Но вскоре они отправляют плёнку на телепередачу забавных видео, чтобы получить приз. Картман в шоке.\nТакже Картман решает узнать у своей матери про своего отца. Выясняется, что она и сама не знает кто является отцом Эрика. Под подозрением все мужчины города. Доктор Мефесто при помощи генетической экспертизы решает определить отца Картмана."
            }
        ],
        "number_of_episodes": 13
    },
    {
        "title": "Сезон 2",
        "url": "http://online-south-park.ru/season-2/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-02.jpg",
        "episodes": [
            {
                "title": "2 сезон 1 серия: Не без моего ануса",
                "url": "http://online-south-park.ru/season-2/221-2-sezon-1-seriya-ne-bez-moego-anusa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435134642_1.jpg",
                "description": "Последняя серия 1 сезона закончилась интригой. Люди ждали продолжения, но создатели \"Южного парка\" решили пошутить. Первой серией второго сезона стала вот эта серия про Терренса и Филлипа.\nФиллип защищает Терренса в суде, поскольку последнего обвиняют в убийстве. Обвинителем является Скотт. Несмотря на явные доказательства вины Терренса, его оправдывают, но Скотт обещает отомстить..."
            },
            {
                "title": "2 сезон 2 серия: Мамаша Картмана по-прежнему грязная шлюха",
                "url": "http://online-south-park.ru/season-2/222-2-sezon-2-seriya-mamasha-kartmana-po-prezhnemu-gryaznaya-shlyuha.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435139647_1.jpg",
                "description": "Долгожданное продолжение событий последней серии первого сезона.\nИтак, Мефесто собирается открыть тайну, сказав, кто является отцом Картмана. Но внезапно свет гаснет, и раздаётся выстрел. Стреляли в Мефесто, но он выжил. Шеф и ребята отвозят его в больницу."
            },
            {
                "title": "2 сезон 3 серия: Куролюб",
                "url": "http://online-south-park.ru/season-2/224-2-sezon-3-seriya-kurolyub.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435219115_1.jpg",
                "description": "Кто-то в городе насилует курицу, а на месте преступления оставляет записку с подсказкой. Офицер Барбреди игнорирует записку и пытается найти другие зацепки. Но почему он это сделал? Выясняется, что Барбреди не умеет читать. Когда это становится известно, он решает уйти из полиции. В городе начинается хаос, и мэр решает не увольнять полицейского, а отправить его в школу."
            },
            {
                "title": "2 сезон 4 серия: Пиписька Айка",
                "url": "http://online-south-park.ru/season-2/225-2-sezon-4-seriya-pipiska-ayka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435220349_1.jpg",
                "description": "Мистер Маки рассказывает третьеклассникам о вреде наркотиков и в особенности марихуаны. Чтобы дети запомнили марихуану, он пускает лист травки по классу. Разумеется, травка пропадает, за что его увольняют...\nТем временем Кайл приглашает друзей на бриз Айка. Он ещё не знает, что это такое..."
            },
            {
                "title": "2 сезон 5 серия: Женщина с приросшим эмбрионом",
                "url": "http://online-south-park.ru/season-2/226-2-sezon-5-seriya-zhenschina-s-prirosshim-embrionom.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435312960_1.jpg",
                "description": "Во время игры в вышибалы Пип разбивает нос Кайлу. Последний вынужден идти к школьной медсестре, о которой по школе ходят страшные слухи. Выясняется, что медсестра страдает редкой болезнью - мислексией сросшихся близнецов. То есть, к её щеке прирос мёртвый зародыш. Она сильно пугает Кайла, после чего к ней приковывается внимание окружающих. Это очень странно, ведь эмбрион на её щеке был всегда, но на это никто не обращал внимание ранее."
            },
            {
                "title": "2 сезон 6 серия: Мексиканская пялящаяся лягушка с южной Шри-Ланки",
                "url": "http://online-south-park.ru/season-2/227-2-sezon-6-seriya-meksikanskaya-pyalyaschayasya-lyagushka-s-yuzhnoy-shri-lanki.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435325270_1.jpg",
                "description": "Ребята решают отомстить дяде Джимбо за кол, полученный за домашнее задание на тему вьетнамской войны. Поскольку Джимбо уже давно хочет заснять мексиканскую пялящуюся лягушку с южной Шри-Ланки, ребята решают отправить в его шоу кассету с видеозаписью лягушки. Разумеется, на видео была кукла вместо лягушки, а пацаны хотели разыграть его. Но шутка принесла обратный эффект: все поверили, а рейтинг шоу дяди Джимбо возрос."
            },
            {
                "title": "2 сезон 7 серия: Город на краю вечности",
                "url": "http://online-south-park.ru/season-2/228-2-sezon-7-seriya-gorod-na-krayu-vechnosti.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435575077_1.jpg",
                "description": "Мисс Колтун вынуждена везти школьный автобус по опасной горной дороге. Она не справляется с управлением, и 2 задних колеса оказываются над пропастью. Автобус балансирует над пропастью. Мисс Колтун отправляется за помощью и говорит детям, чтобы те не выходили из автобуса, поскольку их заберёт монстр..."
            },
            {
                "title": "2 сезон 8 серия: Лето — отстой",
                "url": "http://online-south-park.ru/season-2/229-2-sezon-8-seriya-leto-otstoy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435577149_1.jpg",
                "description": "Наступают летние каникулы. Но они не являются долгожданными, потому что летом в Саут-Парке делать абсолютно нечего. Да к тому же в этом году был издан закон, запрещающий фейерверки.\nМэр города тоже разочарована, ведь из-за запрета фейерверков нельзя нормально провести День независимости. Но ей подсказывают неплохую альтернативу: вместо пиротехники использовать дымовую шашку для создания огромного дымового змея. Но в итоге этот змей выходит из под контроля, убив кучу народа и разрушив пол-города."
            },
            {
                "title": "2 сезон 9 серия: Солёные шоколадные яйца Шефа",
                "url": "http://online-south-park.ru/season-2/230-2-sezon-9-seriya-solenye-shokoladnye-yayca-shefa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435672305_0.jpg",
                "description": "Саут-Парк был избран для проведения кинофестиваля независимых фильмов \"Сандэнс\". Это привело к гигантскому наплыву людей в маленький городок, из-за чего стало нарушаться хрупкое равновесие канализации. Мистер Хэнки зовёт к себе Кайла и просит о помощи."
            },
            {
                "title": "2 сезон 10 серия: Ветрянка",
                "url": "http://online-south-park.ru/season-2/257-2-sezon-10-seriya-vetryanka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-09/1443179163_1.jpg",
                "description": "Шелли заболевает ветрянкой. Когда её родители узнают, что ветрянкой лучше переболеть в детстве, то они пытаются заразить этой болезнью Стэна. Более того, Родители Кайла и Картмана тоже пытаются это сделать. Для этого ребят отправляют к Кенни, который как раз болен ветрянкой."
            },
            {
                "title": "2 сезон 11 серия: Роджеру Эберту следует отказаться от жирной пищи",
                "url": "http://online-south-park.ru/season-2/231-2-sezon-11-seriya-rodzheru-ebertu-sleduet-otkazatsya-ot-zhirnoy-pischi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435673384_1.jpg",
                "description": "Третьеклассники отправляются в планетарий. Это оказывается скучнейшая экскурсия в их жизни. Однако вскоре после похода туда им всем хочется побывать там снова. Очевидно, это результат воздействия гипнотического освещения, включенного в планетарии. Но зачем владелец планетария гипнотизирует людей?\nТем временем Картман избегает экскурсии и участвует в конкурсе на роль в рекламе сырных подушечек."
            },
            {
                "title": "2 сезон 12 серия: Домики для игр",
                "url": "http://online-south-park.ru/season-2/232-2-sezon-12-seriya-domiki-dlya-igr.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435674870_1.jpg",
                "description": "Венди предлагает Стэну построить домик на дереве, где они бы смогли играть и свести вместе Кайла и Бебе. Стэн соглашается и вместе с Кайлом приступает к строительству. Картман и Кенни решают построитьсвоё казино с блекджеком и шлюхамисвой домик на дереве и тоже пригласить туда девушек. И им это удаётся даже раньше, чем Стэну с Кайлом.\nТем временем родители Стэна серьёзно ссорятся. Рэнди уходит из семьи и начинает жить счастливой жизнью холостяка, а Шэрон приглашает в дом некоего Роя, который заменяет Стэну отца."
            },
            {
                "title": "2 сезон 13 серия: Коровьи дни",
                "url": "http://online-south-park.ru/season-2/233-2-sezon-13-seriya-korovi-dni.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1435754128_1.jpg",
                "description": "В Саут-Парке проходит ежегодная ярмарка «Коровьи дни». Это скучнейшее мероприятие с дебильными аттракционами, которое, тем не менее, очень нравится жителям города. В этом году на одном из аттракционов Кайл решает выиграть куклы Терренса и Филлипа. Ему нужно всего-лишь забросить мяч в рот картонной Дженнифер Лав Хьюитт. Но шары больше, чем отверстие, и Кайл терпит неудачи. Это выливается в целое приключение по добыче денег для покупки попыток."
            },
            {
                "title": "2 сезон 14 серия: Шефская помощь",
                "url": "http://online-south-park.ru/season-2/234-2-sezon-14-seriya-shefskaya-pomosch.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1435756194_1.jpg",
                "description": "Шеф узнаёт, что написанную им много лет назад песню продаёт одна звукозаписывающая компания. Но глава компании решает подать в суд на Шефа, утверждая, что это не его песня. Суд удовлетворяет иск, и Шефу грозит тюрьма, либо штраф в размере $2000000. Ребята решают помочь Шефу собрать деньги."
            },
            {
                "title": "2 сезон 15 серия: Страшная рыбка",
                "url": "http://online-south-park.ru/season-2/235-2-sezon-15-seriya-strashnaya-rybka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1435925597_1.jpg",
                "description": "Страшная серия \"Южного парка\", вышедшая на Хэллоуин. Создатели решили пошутить, и чтобы сделать серию ещё страшнее, было принято решение поместить в углы экрана фотография Барбры Стрейзанд.\nА что касается сюжета, то к семье Маршей приезжает тётя Фло. Она дарит Стэну рыбку в аквариуме, но Стэн считает, что рыбка зловещая.\nТем временем Картман становится добрым и почему-то у него появляется бородка."
            },
            {
                "title": "2 сезон 16 серия: Счастливого Рождества, Чарли Мэнсон!",
                "url": "http://online-south-park.ru/season-2/236-2-sezon-16-seriya-schastlivogo-rozhdestva-charli-menson.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1435927204_1.jpg",
                "description": "Под Рождество ребята отправляются к родне Картмана в Небраску. По пути пацаны узнают, что в Небраску в один из супермаркетов приедет мистер Хэнки.\nНочью ребята слышат, как кто-то залезает в дом. Это оказывается Ховард (дядя Картмана), сбежавший из тюрьмы. Он также приводит за собой своего сокамерника — преступника по имени Чарльз Мэнсон (реальная личность, кстати)."
            },
            {
                "title": "2 сезон 17 серия: Гномы",
                "url": "http://online-south-park.ru/season-2/237-2-sezon-17-seriya-gnomy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1435930936_1.jpg",
                "description": "Стэн, Кайл, Эрик, Кенни и Твик должны вместе написать доклад на любую тему. Твик предлагает написать о гномах, которые воруют ночью его подштанники. Ребята насмехаются над ним, но... гномы существуют.\nА отец Твика решает воспользоваться ребятами, чтобы избавиться от своего конкурента, очень крупной кофейни."
            },
            {
                "title": "2 сезон 18 серия: Доисторический ледяной человек",
                "url": "http://online-south-park.ru/season-2/238-2-sezon-18-seriya-doistoricheskiy-ledyanoy-chelovek.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-07/1436446926_1.jpg",
                "description": "После просмотра шоу про охотника на крокодилов ребята отправляются сами охотиться на крокодилов в... горы. Там Кайл проваливается под снег в пещеру. Стэн, спустившийся за ним, находит там доисторического ледяного человека. Ребята привозят его в город, а Мефесто размораживает его..."
            }
        ],
        "number_of_episodes": 18
    },
    {
        "title": "Сезон 3",
        "url": "http://online-south-park.ru/season-3/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-03.jpg",
        "episodes": [
            {
                "title": "3 сезон 1 серия: Джунгли-Шмунгли",
                "url": "http://online-south-park.ru/season-3/206-3-sezon-1-seriya-dzhungli-shmungli.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434455011_1.jpg",
                "description": "В школу приезжает хор, выступающий в защиту лесов. За неуважение к хору ребята обязаны отправиться в тур вместе с ними в Коста-Рику. Там после репетиции дети с воспитательницей отправляются в лес, который они как раз прибыли защищать. Но этот лес чуть не становится их кладбищем."
            },
            {
                "title": "3 сезон 2 серия: Самопроизвольное возгорание",
                "url": "http://online-south-park.ru/season-3/207-3-sezon-2-seriya-samoproizvolnoe-vozgoranie.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434540624_1.jpg",
                "description": "Во время разговора о своей подружке самопроизвольно возгорается и погибает Кенни. После этого в городе ещё несколько человек погибло таким образом. Мэр поручает Рэнди разобраться с этой проблемой."
            },
            {
                "title": "3 сезон 3 серия: Суккуб",
                "url": "http://online-south-park.ru/season-3/208-3-sezon-3-seriya-sukkub.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434543921_1.jpg",
                "description": "В школе появляется новый повар. Выясняется, что Шеф уволился, потому что встретил красивую женщину. Ребята же считают, что это не женщина, а суккуб. Они пытаются разрушить чары, воздействующие на Шефа.\nТем временем Эрик вынужден посещать окулиста из-за проблем со зрением. Картман не хочет к нему ходить, потому что врач высмеивает его лишний вес, называя свинкой."
            },
            {
                "title": "3 сезон 4 серия: Твик против Крэйга",
                "url": "http://online-south-park.ru/season-3/209-3-sezon-4-seriya-tvik-protiv-kreyga.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434545623_1.jpg",
                "description": "Ребята стравливают Твика и Крэйга, чтобы узнать, кто из них круче дерётся. Дети делают ставки, но выясняется, что Твик и Крэйг не умеют драться. Придётся их учить.\nТем временем учитель труда мистер Адлер вспоминает свою девушку, которая, судя по флешбекам, разбилась на самолёте."
            },
            {
                "title": "3 сезон 5 серия: Яковозавры",
                "url": "http://online-south-park.ru/season-3/258-3-sezon-5-seriya-yakovozavry.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-09/1443180331_1.jpg",
                "description": "Ребята отправляются на отдых на природу. Там Картман (а потом и остальные) натыкается на странное существо. Выясняется, что эти существа (которых прозвали \"яковозавры\") практически вымерли. Вскоре находят ещё одного яковозавра, а это значит, что их популяцию можно восстановить."
            },
            {
                "title": "3 сезон 6 серия: Панда сексуальных домогательств",
                "url": "http://online-south-park.ru/season-3/210-3-sezon-6-seriya-panda-seksualnyh-domogatelstv.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434623410_1.jpg",
                "description": "Третьеклассники на уроке знакомятся с пандой \"Сексуальное домогательство\", которая в игривой форме рассказывает о том, что такое \"Сексуальное домогательство\". Это оказывается очень скучный урок, который приносит личную пользу только Картману. Используя полученные знания, Картман собирается засудить Стэна, поскольку последний, якобы, сексуально домогался его. На самом деле Стэн просто назвал Эрика жополизом..."
            },
            {
                "title": "3 сезон 7 серия: Кошачья оргия",
                "url": "http://online-south-park.ru/season-3/211-3-sezon-7-seriya-koshachya-orgiya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434624369_1.jpg",
                "description": "Мама Картмана отправляется на вечеринку по случаю метеорного дождя в дом мистера Мэки. Шелли (сестра Стэна) стала няней для жирдяя. Как только они остались наедине, Шейли начинает избивать Эрика. Позже она приглашает своего парня в дом Картмана. Дело идут фигово для Эрика. А тут ещё, как на зло, у кошки началась течка и ей срочно понадобился сексуальный партнёр."
            },
            {
                "title": "3 сезон 8 серия: Два голых парня в горячей ванне",
                "url": "http://online-south-park.ru/season-3/212-3-sezon-8-seriya-dva-golyh-parnya-v-goryachey-vanne.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434624834_1.jpg",
                "description": "События данного эпизода происходят параллельно событиям предыдущей серии. Мистер Мэки устраивает вечеринку по случаю метеорного дождя, на которую приходит много людей. Полиция решает, что это собрание сектантов, планирующих совершить массовое самоубийство, поэтому полицейские пытаются убить их всех перед тем, как они совершат самоубийство. Джеральд и Рэнди занимаются мастурбацией, лёжа в джакузи, после чего Рэнди начинает мучиться из-за чувства неловкости."
            },
            {
                "title": "3 сезон 9 серия: Иубилей",
                "url": "http://online-south-park.ru/season-3/213-3-sezon-9-seriya-iubiley.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434712689_1.jpg",
                "description": "Данная серия является третьей в трилогии, посвящённой событиям во время метеорного дождя.\nКайл готовится к поездке в еврейский детский лагерь, где должно произойти что-то значимое. К нему напрашивается Кенни. Но Кайл предупреждает, что в лагерь пускают только еврейских детей, поэтому, если там обнаружат, что Кенни не еврей, то это может плохо кончиться."
            },
            {
                "title": "3 сезон 10 серия: Чинпокомон",
                "url": "http://online-south-park.ru/season-3/214-3-sezon-10-seriya-chinpokomon.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434713797_1.jpg",
                "description": "У детей Южного парка появляется новое хобби - коллекционирование чинпокомонов (пародия на покемонов). Взрослые не могут понять, в чём причина успеха этих игрушек. Но вскоре выясняется, что эти игрушки не простые."
            },
            {
                "title": "3 сезон 11 серия: Кошмарный Марвин в космосе",
                "url": "http://online-south-park.ru/season-3/216-3-sezon-11-seriya-koshmarnyy-marvin-v-kosmose.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434976171_1.jpg",
                "description": "На Землю прилетает инопланетянин и погибает в лапах львов в Африке. Его космический корабль находит Кошмарный Марвин. Пацан садится за штурвал и начинает летать по разным странам в поисках лучшей жизни. Но выясняет, что вся планета заражена вирусом Христианства. Вскоре вместе с главными героями мультсериала Марвин попадает в идеальное место - планету Марклар."
            },
            {
                "title": "3 сезон 12 серия: Отличная загадка группы Korn о пиратском призраке",
                "url": "http://online-south-park.ru/season-3/215-3-sezon-12-seriya-otlichnaya-zagadka-gruppy-korn-o-piratskom-prizrake.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434723616_1.jpg",
                "description": "Серия, вышедшая под Хэллоуин.\nПятиклассники пугают ребят нарисованными призраками пиратов. В ответ пацаны планируют напугать пятиклассников. Для этого они выкапывают из могилы мёртвую бабушку Кайла...\nВ Южный парк приезжает группа KoRn, чтобы дать концерт. Сразу после их появления в городе начинают появляться настоящие призраки пиратов. Как это связано с ними?"
            },
            {
                "title": "3 сезон 13 серия: Увлекательная фонетика с обезьянкой",
                "url": "http://online-south-park.ru/season-3/217-3-sezon-13-seriya-uvlekatelnaya-fonetika-s-obezyankoy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434977472_1.jpg",
                "description": "Среди третьеклассников должна пройти олимпиада по орфографии. Картман получает от своей мамы набор \"Увлекательная фонетика с обезьянкой\" для подготовки. Но это не помогает жирдяю провалиться в 1 же туре. А победителями становятся некие Марк и Ребекка. Ребята никогда в жизни их не видели. А всё потому что Марк и Ребекка обучаются на дому и никогда не посещали школу..."
            },
            {
                "title": "3 сезон 14 серия: Алый знак веселья",
                "url": "http://online-south-park.ru/season-3/218-3-sezon-14-seriya-alyy-znak-veselya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435055727_1.jpg",
                "description": "Ребята репетируют свои роли в постановке реконструкции Гражданской войны США. Картман, который не может нормально играть на барабане, уходит из квартета и переодевается в генерала Ли, ключевую личность армии юга. Он клянётся, что на этот раз в реконструкции победят южане. Стэн и Кайл смеются над ним, ведь нельзя изменить ход истории, а в данной постановке должна победить армия севера, как это было в реальности."
            },
            {
                "title": "3 сезон 15 серия: Классические рождественские песни от мистера Хэнки",
                "url": "http://online-south-park.ru/season-3/219-3-sezon-15-seriya-klassicheskie-rozhdestvenskie-pesni-ot-mistera-henki.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435056510_1.jpg",
                "description": "Рождественская серия мультсериала \"Южный парк\". Здесь представлены несколько пародий на известные в США песни. Всё это будет исполняться героями South Park'а. Мистер Хэнки будет ведущим."
            },
            {
                "title": "3 сезон 16 серия: Господь, ты там? Это я, Иисус",
                "url": "http://online-south-park.ru/season-3/220-3-sezon-16-seriya-gospod-ty-tam-eto-ya-iisus.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435061998_1.jpg",
                "description": "Картман радуется, что наконец-то стал взрослым, потому что у него начались критические дни. Он ещё не знает, что у мужчин нет критических дней, а у него просто кишечная болезнь. Поэтому жирдяй решает, что он слишком крут, чтобы тусоваться с остальными пацанами. Но вскоре и у Кенни начинается то же самое..."
            },
            {
                "title": "3 сезон 17 серия: Всемирный флейтовый концерт",
                "url": "http://online-south-park.ru/season-3/223-3-sezon-17-seriya-vsemirnyy-fleytovyy-koncert.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1435143205_1.jpg",
                "description": "Весь класс ребят отправляют в Арканзас на всемирный флейтовый концерт, на котором все третьеклассники США должны будут исполнить мелодию патриотической песни. Там ребята ссорятся с третьеклассниками школы Нью-Йорка и желают им отомстить за обиду.\nМистер Гаррисон же хочет избежать поездки в Арканзас, потому что там живут его родители. Мистер Мэки узнаёт у Гаррисона, что проблема в сексуальных домогательствах со стороны отца Гаррисона."
            }
        ],
        "number_of_episodes": 17
    },
    {
        "title": "Сезон 4",
        "url": "http://online-south-park.ru/season-4/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-04.jpg",
        "episodes": [
            {
                "title": "4 сезон 1 серия: Тупое преступление Картмана 2000",
                "url": "http://online-south-park.ru/season-4/189-4-sezon-1-seriya-tupoe-prestuplenie-kartmana-2000.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433504662_1.jpg",
                "description": "Картман попадает в колонию для несовершеннолетних за то, что бросил в Токена камень. В тюрьме Эрика сажают в камеру с неким Топтыжкой, который сразу невзлюбил жиртреста.\nТем временем ребята готовятся к гонкам на санках против команды девочек."
            },
            {
                "title": "4 сезон 2 серия: Зуб за зуб зубной феи 2000",
                "url": "http://online-south-park.ru/season-4/190-4-sezon-2-seriya-zub-za-zub-zubnoy-fei-2000.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433508086_1.jpg",
                "description": "Мама Картмана подкладывает под подушку своему сыну 2 доллара за каждый выпавший зуб. Эрик уверен, что это зубная фея хорошо относится к нему. Почуяв золотую жилу, ребята начинают отдавать Картману по несколько зубов ежедневно. Когда ситуация выходит за рамки разумного, мать Картмана признаёт, что зубной феи нет, и это она подкладывала деньги под подушку Эрику. Ребята расстроены, но решают не останавливаться и начинают подкладывать зубы под подушку другим детям с целью получения денег."
            },
            {
                "title": "4 сезон 3 серия: Пятерняшки 2000",
                "url": "http://online-south-park.ru/season-4/191-4-sezon-3-seriya-pyaternyashki-2000.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433509077_1.jpg",
                "description": "Мальчики отправляются с родителями на представление цирка Дю Шевиль. Это была скука смертная. Но одно выступление, в котором участвовали 5 одинаковых девочек, ребятам понравилось. После этого ребята захотели создать свой цирк. В тот же вечер в дом к Маршам стучится бабушка, сбежавшая из цирка вместе со своими внучками - теми самыми пятерняшками."
            },
            {
                "title": "4 сезон 4 серия: Тимми 2000",
                "url": "http://online-south-park.ru/season-4/192-4-sezon-4-seriya-timmi-2000.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433765806_1.jpg",
                "description": "В классе, в котором учатся ребята, появляется новый ученик Тимми. Он инвалид и умственно-отсталый, но никто из взрослых этого не понимают. Мистер Гаррисон требует от Тимми слишком многого и в итоге отправляет его к директрисе и школьному психологу. Вскоре Тимми ставят диагноз \"синдром дефицита внимания\" и освобождают от домашнего задания. Теперь все ребята стараются получить этот диагноз..."
            },
            {
                "title": "4 сезон 5 серия: Пип",
                "url": "http://online-south-park.ru/season-4/200-4-sezon-5-seriya-pip.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434020267_1.jpg",
                "description": "Серия Южного парка, целиком посвящённая Пипу.\nОчевидно, здесь показана жизнь Пипа до его переезда в Саут-Парк. Его родители умерли, а он сам был приёмным сыном бедного кузнеца. Последний выковывает газету, в которой обнаруживает объявление о том, что требуется молодой человек, который должен будет играть с дочерью одной очень богатой женщины. Оплата достойная, и Пип решает откликнуться."
            },
            {
                "title": "4 сезон 6 серия: Картман вступает в NAMBLA (АДМБ)",
                "url": "http://online-south-park.ru/season-4/193-4-sezon-6-seriya-kartman-vstupaet-v-nambla-admb.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433766691_1.jpg",
                "description": "Картман считает, что он перерос своих друзей. Поэтому он начинает искать друзей среди взрослых. Для этого он лезет на сайт знакомств и пишет в анкете, что он мальчик и хочет познакомиться со взрослым мужчиной. Эрику начинают писать множество людей. Он радуется, не догадываясь, что ему пишут педофилы..."
            },
            {
                "title": "4 сезон 7 серия: Тампоны из волос чероки",
                "url": "http://online-south-park.ru/season-4/194-4-sezon-7-seriya-tampony-iz-volos-cheroki.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433770857_1.jpg",
                "description": "У Кайла серьёзные проблемы с почками. Нужна операция. Но вместо этого его мать приводит своего сына в местную аптеку народных лекарств. Там некая мисс Информация утверждает, что виной болезни Кайла являются токсины, которые нужно вымыть из организма народными средствами, приготавливаемыми индейцами. А Кайлу всё хуже и хуже..."
            },
            {
                "title": "4 сезон 8 серия: Шеф теряет терпение",
                "url": "http://online-south-park.ru/season-4/195-4-sezon-8-seriya-shef-teryaet-terpenie.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433856528_1.jpg",
                "description": "Шеф настаивает на замене флага Саус-Парка, потому что на нем 4 белых человека вешают чёрного. Но у этого флага большая история. Менять ли флаг? Новый учитель третьеклассников решает устроить дебаты, разделив ребят на 2 группы. Одна группа должна доказать, что флаг нужно заменить, а вторая - наоборот, оставить."
            },
            {
                "title": "4 сезон 9 серия: Кое-что, что можно сделать пальцем",
                "url": "http://online-south-park.ru/season-4/196-4-sezon-9-seriya-koe-chto-chto-mozhno-sdelat-palcem.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433934302_1.jpg",
                "description": "После увиденного сна Картман становится одержимым идеей создания молодёжной мальчишечьей  группы под названием \"Фингертрах\" наподобие Backstreet Boys. Он пророчит известность группе и кучу бабла. Но для этого им нужен пятый участник. Им становится Венди, переодетая в мальчика. Всё бы ничего, но отец Стэна категорически против участия своего сына в данном проекте."
            },
            {
                "title": "4 сезон 10 серия: Попадают ли умственно отсталые в ад?",
                "url": "http://online-south-park.ru/season-4/197-4-sezon-10-seriya-popadayut-li-umstvenno-otstalye-v-ad.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433935019_1.jpg",
                "description": "Ребята были запуганы священником и стали богобоязненными. Картман начинает призывать всех друзей и близких людей вести праведный образ жизни и поклоняться Богу...\nВторая часть серии посвящена параллельным событиям в аду. К Сатане в дом стучится Саддам Хуссейн, убитый первым в полнометражном выпуске \"Южного парка\". Саддам предлагает возобновить отношения, но у Сатаны появился новый любовник - некий Крис."
            },
            {
                "title": "4 сезон 11 серия: Возможно",
                "url": "http://online-south-park.ru/season-4/198-4-sezon-11-seriya-vozmozhno.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433936890_1.jpg",
                "description": "События предыдущей серии продолжаются. Саддам Хуссейн убивает Криса, но тот вновь возрождается в аду. Между ними начинается конфликт.\nКартман же открывает собственную церковь, где занимается спасением людей."
            },
            {
                "title": "4 сезон 12 серия: Четвёртый класс",
                "url": "http://online-south-park.ru/season-4/199-4-sezon-12-seriya-chetvertyy-klass.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434017743_1.jpg",
                "description": "Ребята переходят в 4 класс. Им назначают новую учительницу - мисс Заглотник. Это женщина с сильно обвисшими сиськами. Он сразу же даёт понять ученикам, что в 4 классе их детство оканчивается и впереди их ждёт сложная учёба. Ребята не желают с этим смиряться и обращаются за помощью к 2 типичным задротам-ботаникам, которые соглашаются превратить коляску Тимми в машину времени."
            },
            {
                "title": "4 сезон 13 серия: Школьный портфель",
                "url": "http://online-south-park.ru/season-4/201-4-sezon-13-seriya-shkolnyy-portfel.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434356573_1.jpg",
                "description": "Мать Картмана покупает своему сыну суперорганайзер «Мыс Доусона Футура S 2000». Эта штука оборудована различными устройствами и имеет возможность подсоединяться к любому электронному устройству. Через несколько минут ребята в школьном автобусе замечают странного человека, проявляющего любопытство к органайзеру Картмана. Этот человек, представившийся Биллом Косби, задаёт много вопросов Эрику и в конечном итоге ворует органайзер. Зачем он ему?"
            },
            {
                "title": "4 сезон 14 серия: Хелен Келлер! Мюзикл",
                "url": "http://online-south-park.ru/season-4/202-4-sezon-14-seriya-helen-keller-myuzikl.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434360950_1.jpg",
                "description": "Ребята репетируют пьесу про Хелен Келлер. Они вынуждены не жалеть сил, поскольку Баттерс видел репетицию дошкольников и говорит, что их постановка в разы лучше. Поэтому четвероклассники пытаются сделать свою постановку круче. Они переделывают пьесу в мюзикл, а также решают использовать индюка-инвалида вместо собаки. Роль Хелен Келлер получает Тимми."
            },
            {
                "title": "4 сезон 15 серия: Лагерь для толстяков",
                "url": "http://online-south-park.ru/season-4/203-4-sezon-15-seriya-lager-dlya-tolstyakov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434449138_1.jpg",
                "description": "Картман отправляется в лагерь для толстяков, чтобы сбросить лишний вес. Вскоре из лагеря возвращается новый худой Эрик. Его друзья сразу обратили некоторые странности в его поведении...\nТем временем Кенни начинает зарабатывать неплохие деньги, делая вещи, которые нормальный человек никогда не сделает."
            },
            {
                "title": "4 сезон 16 серия: История о мерзком приставании",
                "url": "http://online-south-park.ru/season-4/204-4-sezon-16-seriya-istoriya-o-merzkom-pristavanii.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434450057_1.jpg",
                "description": "Родители Кайла говорят ему, что он может отправиться на концерт одной группы после того, как он построит демократию на Кубе. Понятно, что задание было выдано из расчёта на то, что Кайл не справится, но он выполняет его. Несмотря на это, его родители запрещают ему идти на концерт. Тогда Картман посоветовал Кайлу идею, чтобы избавиться от родителей. Кайл позвонил в полицию и сказал, что родители его домогались. Так, Шейла и Джеральд попадают в тюрьму..."
            },
            {
                "title": "4 сезон 17 серия: Очень дерьмовое Рождество",
                "url": "http://online-south-park.ru/season-4/205-4-sezon-17-seriya-ochen-dermovoe-rozhdestvo.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1434452010_1.jpg",
                "description": "Приближается Рождество, но у людей не праздничное настроение. И только мистер Хэнки может вернуть дух Рождества. К сожалению, в этот год мистер Хэнки не пришёл. Ребята решают спустить в канализацию, чтобы узнать, что случилось с рождественской какашкой. Выясняется, что у мистера Хэнки есть жена и дети..."
            }
        ],
        "number_of_episodes": 17
    },
    {
        "title": "Сезон 5",
        "url": "http://online-south-park.ru/season-5/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-05.jpg",
        "episodes": [
            {
                "title": "5 сезон 1 серия: Скотт Тенорман должен умереть",
                "url": "http://online-south-park.ru/season-5/173-5-sezon-1-seriya-bolshaya-obschestvennaya-problema.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432898004_1.jpg",
                "description": "У Картмана появляются лобковые волосы. Он стебётся над друзьями, называя их малолетками. Но вскоре ребята сами начинают смеяться над ним, ведь у Эрика не начался рост лобковых волос. Он просто купил их у старшеклассника Скотта Тенормана. Осознав свою тупость, Картман отправляется к Тенорману и решает вернуть свои деньги..."
            },
            {
                "title": "5 сезон 2 серия: Большая общественная проблема",
                "url": "http://online-south-park.ru/season-5/174-5-sezon-2-seriya-bolshaya-obschestvennaya-problema.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432899375_1.jpg",
                "description": "Картман сообщает всем своим друзьям шикарную новость: сегодня по телевизору на одном из каналов прозвучит слово \"говно\". Это привлекает к телевизору толпу быдла. После этого слово \"говно\" плотно входит в обиход. Телевизионщики, смекнув, каким образом можно привлекать людей, решают на этом не останавливаться. Но вскоре люди начинают умирать от странной болезни."
            },
            {
                "title": "5 сезон 3 серия: Бой калек",
                "url": "http://online-south-park.ru/season-5/175-5-sezon-3-seriya-boy-kalek.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432908018_1.jpg",
                "description": "Ребята вместе с Тимми знакомятся в лагере скаутов с Джимми. Поскольку Джимми является инвалидом, как и Тимми, то последний был настроен очень враждебно. Тимми всеми силами пытается выгнать Джимми из отряда скаутов.\nТем временем Эла Гомосека увольняют с поста вожатого из-за его гомосексуальности..."
            },
            {
                "title": "5 сезон 4 серия: Суперлучшие друзья",
                "url": "http://online-south-park.ru/season-5/187-5-sezon-4-seriya-superluchshie-druzya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433418035_1.jpg",
                "description": "В Южном парке появляется секта Дэвида Блэйна. Ребята попадают под её влияние. Стэн отправляется за помощью к Иисусу и узнаёт о команде суперлучших друзей."
            },
            {
                "title": "5 сезон 5 серия: Терренс и Филлип: обратная сторона успеха",
                "url": "http://online-south-park.ru/season-5/178-5-sezon-5-seriya-terrens-i-fillip-obratnaya-storona-uspeha.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433165220_0.jpg",
                "description": "В Южный парк приезжают Терренс и Филлип. Ребята не могут пропустить такое событие и покупают 4 билета. В школе им сообщают, что в ближайшее время четвероклассники должны присутствовать на подготовке к Дню Земли, а явка обязателна. Разумеется, подготовка совпадает с концертом Терренса и Филлипа. Пацаны не могут пропустить концерт и придумывают план..."
            },
            {
                "title": "5 сезон 6 серия: Картманлэнд",
                "url": "http://online-south-park.ru/season-5/179-5-sezon-6-seriya-kartmanlend.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433166439_1.jpg",
                "description": "У Картмана умирает бабушка. В завещании она написала, что Эрику дарит все свои сбережения - 1 миллион долларов. На радостях Картман покупает собственный парк аттракционов. Но он ему нужен не для получения прибыли. Жиртрест покупает парк, чтобы никого туда не пускать и кататься целыми днями.\nТем временем у Кайла развивается геморрой."
            },
            {
                "title": "5 сезон 7 серия: Правильное использование презерватива",
                "url": "http://online-south-park.ru/season-5/180-5-sezon-7-seriya-pravilnoe-ispolzovanie-prezervativa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433239785_1.jpg",
                "description": "После того, как Картман и Стэн \"подоили\" самца собаки, не осознавая, что они делали, в школе вынуждены ввести уроки сексуального воспитания. Эти уроки среди мальчиков стал вести мистер Мэки, который сам ничего не знает о сексе. У девочек же уроки сексуального воспитания вела мисс Заглотник. Она рассказала ученицам, что нужно бояться мальчиков..."
            },
            {
                "title": "5 сезон 8 серия: Полотенчик",
                "url": "http://online-south-park.ru/season-5/181-5-sezon-8-seriya-polotenchik.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433241381_1.jpg",
                "description": "Чтобы ребята забыли неприятный случай с использованным тампоном, мать Стэна покупает им новую игровую приставку \"Сфера Окама\". Ребята собираются просидеть за ней все выходные, но Кайл говорит, что не может, поскольку ему надо ехать с родителями на озеро. Как только он сказал про озеро, появилось говорящий Полотенчи, предупредив его о необходимости брать с собой на озеро полотенце..."
            },
            {
                "title": "5 сезон 9 серия: У Усамы бен Ладена вонючие штаны",
                "url": "http://online-south-park.ru/season-5/182-5-sezon-9-seriya-u-usamy-ben-ladena-vonyuchie-shtany.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433242900_1.jpg",
                "description": "Ребята, желая помочь детям Афганистана, отправляют им по 1 доллару. Эти доллары получают дети, напоминающие афганские версии главных героев Южного парка. Они в свою очередь отправляют ребятам в США козу. Поскольку Стэн, Кайл, Картман и Кенни понятия не имеют как ухаживать за козой, они решают отправить животное назад. Но по ошибке отправляются вместе с козой в Афганистан."
            },
            {
                "title": "5 сезон 10 серия: Как питаться с помощью задницы",
                "url": "http://online-south-park.ru/season-5/183-5-sezon-10-seriya-kak-pitatsya-s-pomoschyu-zadnicy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433253993_1.jpg",
                "description": "В школе фотографируют четвероклассников. Кенни решает прикольнуться: просовывает жопу в капюшон своей парки и фотографируется таким образом. Чтобы было ещё смешнее, Картман отправляется на молокозавод и просит опубликовать фотографию Кенни на пакетах с молоком, утверждая, что это пропавший мальчик. Но в соседнем штате живёт семья с жопами вместо лиц, у которых пропал ребёнок..."
            },
            {
                "title": "5 сезон 11 серия: Сущность",
                "url": "http://online-south-park.ru/season-5/184-5-sezon-11-seriya-suschnost.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433331371_1.jpg",
                "description": "К Кайлу в гости приезжает его двоюродный брат, которого тоже зовут Кайл. Он оказался редкостным нердом, который постоянно нудит. Чтобы Картман не издевался над ним, Кайл обещает дать ему $40. Но это оказывается выше возможностей Эрика. Вскоре все ребята пытаются сбагрить новенького Кайла куда-нибудь подальше.\nТем временем мистер Гаррисон изобретает новое транспортное средство."
            },
            {
                "title": "5 сезон 12 серия: Приходят соседи",
                "url": "http://online-south-park.ru/season-5/185-5-sezon-12-seriya-prihodyat-sosedi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433335558_1.jpg",
                "description": "Ребята (особенно Картман) подкалывают Токена, потому что его родители являются самыми богатыми в городе. Токен становится изгоем. Он решает найти себе новых богатых друзей. Для этого он пишет статью для журнала Forbes, чтобы богатые люди обратили внимание на Южный парк. План срабатывает."
            },
            {
                "title": "5 сезон 13 серия: Кенни умирает",
                "url": "http://online-south-park.ru/season-5/186-5-sezon-13-seriya-kenni-umiraet.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433336499_1.jpg",
                "description": "Неподалёку от дома Картмана попадает в аварию грузовик, перевозивший эмбрионов. Весь груз оказывается во дворе у Картмана, который решает быстренько продать эмбрионов для исследования стволовых клеток. Но по новому закону ставится запрет на эти исследования.\nА ребята узнают, что Кенни смертельно болен. Ему могут помочь только стволовые клетки, но исследования на них теперь запрещены. Эрик всеми силами будет добиваться разрешения на использование этих клеток. Но действительно ли это всё ему нужно для спасения Кенни?"
            },
            {
                "title": "5 сезон 14 серия: Собственный эпизод Баттерса",
                "url": "http://online-south-park.ru/season-5/188-5-sezon-14-seriya-sobstvennyy-epizod-battersa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433419746_1.jpg",
                "description": "Серия \"Южного парка\", полностью посвященная Баттерсу.\nСтивен (отец Баттерса) отправляется за подарком жене. Баттерс же, играя в инспектора, отправляется за ним, чтобы проследить, и выясняет, что отец по пути зашёл в кино на сеанс для геев и в тренажёрный зал для геев. Не понимая, где был отец, Баттерс рассказывает обо всём матери. У неё конкретно едет крыша..."
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 6",
        "url": "http://online-south-park.ru/season-6/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-06.jpg",
        "episodes": [
            {
                "title": "6 сезон 1 серия: Забастовка уродов",
                "url": "http://online-south-park.ru/season-6/158-6-sezon-1-seriya-zabastovka-urodov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432115326_1.jpg",
                "description": "После просмотра шоу Мори Повича, в котором показывали и награждали изуродованных людей, пацанам приходит в голову идея загримировать Баттерса в урода и отправить на шоу. Так и сделали: Баттерсу приклеили на подбородок силиконовые яйца и отправили получать приз. Он становится победителем, но отказывается делиться призом с ребятами."
            },
            {
                "title": "6 сезон 2 серия: Джаред и его СПИД",
                "url": "http://online-south-park.ru/season-6/159-6-sezon-2-seriya-dzhared-i-ego-spid.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432119353_1.jpg",
                "description": "В Южный парк приезжает новый любимец публики. Его зовут Джаред, ему удаётся быть в отличной форме, питаясь едой из ресторанов быстрого обслуживания, и он готов рассказать толпам зевак о том, как ему это удаётся. Но всё меняется, когда Джаред говорит публике, что ему удаётся быть стройным, потому что у него СПИД..."
            },
            {
                "title": "6 сезон 3 серия: Асспен",
                "url": "http://online-south-park.ru/season-6/160-6-sezon-3-seriya-asspen.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432120732_1.jpg",
                "description": "Мальчики отправляются с родителями в Аспен, самый дорогой и элитный горнолыжный курорт. Пока взрослые находятся на очень и очень долгом рекламной семинаре, ребята учатся кататься на лыжах. Стэн вынужден соревноваться с каким-то профессиональным лыжником."
            },
            {
                "title": "6 сезон 4 серия: Ждём новый фильм Терренса и Филлипа",
                "url": "http://online-south-park.ru/season-6/161-6-sezon-4-seriya-zhdem-novyy-film-terrensa-i-fillipa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432204771_0.jpg",
                "description": "Пацаны собрались около телевизора ради того, чтобы посмотреть полминутный анонс нового фильма с Терренсом и Филлипом в главных ролях. Анонс должен быть показан в рекламном блоке между 2 частями шоу Рассела Кроу, который мочит всех по всему миру. Но во время первого рекламного блока анонс не был показан. Ребята вынуждены ждать второй блок, смотря тупое шоу. Это выливается в целое приключение."
            },
            {
                "title": "6 сезон 5 серия: Спасём телятину",
                "url": "http://online-south-park.ru/season-6/162-6-sezon-5-seriya-spasem-telyatinu.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432205845_1.jpg",
                "description": "На экскурсии ребята узнают как делается телятина. Они и подумать не могли, что при её производстве убивают телят. Поэтому ночью они решают пробраться на ферму, чтобы спасти телят..."
            },
            {
                "title": "6 сезон 6 серия: Профессор Хаос",
                "url": "http://online-south-park.ru/season-6/163-6-sezon-6-seriya-professor-haos.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432291979_1.jpg",
                "description": "Ребята приходят к выводу, что Баттерс не способен заменить Кенни и стать четвёртым в их команде. Поэтому они вежливо дают понять Баттерсу, что он больше не друг им, после чего устраивают конкурс, на котором из 20 детей собираются выбрать лучшего на роль нового друга.\nТем временем расстроенный Баттерс решает отомстить миру за то, что его отвергли..."
            },
            {
                "title": "6 сезон 7 серия: Это уже было в «Симпсонах»",
                "url": "http://online-south-park.ru/season-6/164-6-sezon-7-seriya-eto-uzhe-bylo-v-simpsonah.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432292986_1.jpg",
                "description": "БаттерсПрофессор Хаос продолжает придумывать хитрый план по уничтожению жизни на Земле. Но от своего соратника он узнаёт, что все его идеи были реализованы ранее в «Симпсонах». В итоге Баттерс чуть с ума не сходит, пытаясь придумать что-то новое.\nТем временем ребята выращивают морских человечков в аквариуме..."
            },
            {
                "title": "6 сезон 8 серия: Пылкая католическая любовь",
                "url": "http://online-south-park.ru/season-6/166-6-sezon-8-seriya-pylkaya-katolicheskaya-lyubov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432547939_1.jpg",
                "description": "Родители многих детей Саут-Парка обеспокоены учащающимся попыткам священников изнасиловать детей. Поэтому они решают стать атеистами. Отец Макси из Саут-парка желает исправить ситуацию и возродить веру людей. Но он выясняет, что все священники действительно являются педофилами."
            },
            {
                "title": "6 сезон 9 серия: Даёшь шляпу",
                "url": "http://online-south-park.ru/season-6/165-6-sezon-9-seriya-daesh-shlyapu.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432546739_2.jpg",
                "description": "Пацаны обеспокоены тем, что выходят отвратительные ремейки на их любимые классические фильмы типа «Инопланетянин». Они решаются создать целое движение, чтобы остановить попытки Лукаса и Спилберга переделывать фильмы. Чтобы привлечь как можно больше народа в движение, Картман предлагает дописать в объявление фразу \"Даём шляпу\", ведь люди любят халяву. Но люди не правильно понимают эту фразу..."
            },
            {
                "title": "6 сезон 10 серия: А сиськи всё испортили",
                "url": "http://online-south-park.ru/season-6/167-6-sezon-10-seriya-a-siski-vse-isportili.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432639749_1.jpg",
                "description": "Внезапно все мальчики-четвероклассники стали считать Бебе очень клёвой и интересной. Всё потому, что у неё начали расти сиськи. Вскоре ребята начинают себя вести как обезьяны и виной тому являются сиськи Бебе."
            },
            {
                "title": "6 сезон 11 серия: Похищение детей — это не смешно",
                "url": "http://online-south-park.ru/season-6/168-6-sezon-11-seriya-pohischenie-detey-eto-ne-smeshno.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432640154_1.jpg",
                "description": "В Южном парке участились попытки похищения детей. Поэтому все взрослые рассказывают своим детям о мерах предосторожности при общении с незнакомцами. На фоне всего этого у Твика начинается жуткая паранойя. Он начинает видеть похитителей даже там, где их нет. Ночью к нему является дух людской доброты..."
            },
            {
                "title": "6 сезон 12 серия: Лестница в небо",
                "url": "http://online-south-park.ru/season-6/169-6-sezon-12-seriya-lestnica-v-nebo.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432723613_1.jpg",
                "description": "Ребята узнают, что в лотерее сладостей они выиграли много конфет. Но лотерейный билет был у Кенни, который мёртв. Пацаны отправляются к родителям Кенни и спрашивают о местонахождении тела Кенни, у которого билет должен быть до сих пор. Но оказалось, что Кенни был подвержен кремации, а прах хранится в урне. Не найдя билет, ребята решают построить лестницу в небо, чтобы забрать его у Кенни..."
            },
            {
                "title": "6 сезон 13 серия: Возвращение братства кольца в две башни",
                "url": "http://online-south-park.ru/season-6/170-6-sezon-13-seriya-vozvraschenie-bratstva-kolca-v-dve-bashni.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432729014_1.jpg",
                "description": "Ребята играют во \"Властелина Колец\". Родители Стэна решают воспользоваться этим и просят доставить видеокассету с фильмом \"Властелин колец: Две крепости\" родителям Баттерса. Пацаны воспринимают это как серьёзное поручение и соглашаются. Вот только по ошибке Рэнди им отдал не фильм, а кассету с порно..."
            },
            {
                "title": "6 сезон 14 серия: Концлагерь терпимости",
                "url": "http://online-south-park.ru/season-6/171-6-sezon-14-seriya-konclager-terpimosti.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432734757_1.jpg",
                "description": "Мистер Гаррисон всеми силами пытается добиться своего увольнения за свою гомосексуальность, чтобы после этого отсудить у школы миллионы долларов за дискриминацию и нетерпимость к геям. Для этого он начинает проводить уроки вместе со своим помощником - мистером Мазохистом, которого Гаррисон подвергает унижениям и пыткам при детях..."
            },
            {
                "title": "6 сезон 15 серия: Самый большой говнюк во Вселенной",
                "url": "http://online-south-park.ru/season-6/172-6-sezon-15-seriya-samyy-bolshoy-govnyuk-vo-vselennoy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432806960_1.jpg",
                "description": "После того, какдуша Кенни попала в тело Картмана, ребята стали придумывать как изгнать Кенни из жиртреста. Шеф предлагает отправиться к Джону Эдварду, экстрасенсу, который ведёт собственное шоу на ТВ. Но оказалось, что Эдвард - самы настоящий говнюк и шарлотан. Тем не менее, он убеждает Кайла, что общался с его бабушкой."
            },
            {
                "title": "6 сезон 16 серия: Я и моё будущее",
                "url": "http://online-south-park.ru/season-6/176-6-sezon-16-seriya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433151479_1.jpg",
                "description": "В дверь семьи Марш стучит молодой человек и представляется Стэном из будущего. Он действительно похож на Стэна, но курит, бухает и выглядит как бомж-хиппи. Из его слов становится ясно, что часть детства он провёл в колонии для несовершеннолетних, медленно скатываясь в дерьмо, а потом в грозу его телепортировало в прошлое. Родители Стэна, приводя в пример его взрослую версию из будущего, настоятельно рекомендуют своему настоящему сыну не трогать сигареты и учиться лучше..."
            },
            {
                "title": "6 сезон 17 серия: Убить Санта-Клауса",
                "url": "http://online-south-park.ru/season-6/177-6-sezon-17-seriya-ubit-santa-klausa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-06/1433152209_1.jpg",
                "description": "Чтобы компенсировать плохие поступки в течение года и получить подарок от Санты, Картман решает подарить жителям Ирака Рождество. Благодаря мистеру Говняшке, Эрик с друзьями попадает на северный полюс и уговаривает Санта-Клауса устроить праздник иракцам. Но террористы сбивают сани Санты прямо над Багдадом. Он становится заложником..."
            }
        ],
        "number_of_episodes": 17
    },
    {
        "title": "Сезон 7",
        "url": "http://online-south-park.ru/season-7/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-07.jpg",
        "episodes": [
            {
                "title": "7 сезон 1 серия: Шоу закрыто",
                "url": "http://online-south-park.ru/season-7/142-7-sezon-1-seriya-shou-zakryto.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429703864_1.jpg",
                "description": "Ребята замечают, что с ними происходят события, которые уже происходили в самой первой серии Южного парка. Картман снова вспоминает про свой сон с инопланетянами. Но на этот раз ребята с Эриком отправляются к проктологу, где обнаруживают анальный зонд в жопе жирдяя. Предстоит выяснить цель установки зонда и... спасти Землю."
            },
            {
                "title": "7 сезон 2 серия: Сумасшедшие калеки",
                "url": "http://online-south-park.ru/season-7/143-7-sezon-2-seriya-sumasshedshie-kaleki.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429704901_1.jpg",
                "description": "Джимми возмущён, узнав, что многие жители Саут-Парка пошли на выступление Кристофера Рива, ставшего инвалидом в результате несчастного случая. Потому что по сути он не является инвалидом с рождения. Поэтому Джимми организует клуб инвалидов с рождения, в который, помимо него, вступил только Тимми. Но оказывается, что уже существует клуб под названием \"Калеки\". Джимми и Тимми решают вступить в него, не догадываясь, что это банда."
            },
            {
                "title": "7 сезон 3 серия: Туалетная бумага",
                "url": "http://online-south-park.ru/season-7/144-7-sezon-3-seriya-tualetnaya-bumaga.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429709399_1.jpg",
                "description": "Ребята закидывают дом одной своей учительницы туалетной бумагой. Это была их месть за то, что она их наказала, оставив после уроков. После этого Кайла начинают мучить угрызения совести, и он хочет во всём признаться. Картман не может этого допустить..."
            },
            {
                "title": "7 сезон 4 серия: Я люблю кантри",
                "url": "http://online-south-park.ru/season-7/145-7-sezon-4-seriya-ya-lyublyu-kantri.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429797095_1.jpg",
                "description": "Жители Южного парка разделились на 2 противоборствующих лагеря: сторонников войны в Ираке и их противников. Ребята в школе получают задание — написать сочинение на тему этой войны. Картман, не желающий изучать учебник по истории, решает попасть в кому в результате несчастного случая, надеясь, что во сне он попадёт в прошлое. И это ему удаётся."
            },
            {
                "title": "7 сезон 5 серия: Толстая задница и тупая башка",
                "url": "http://online-south-park.ru/season-7/147-7-sezon-5-seriya-tolstaya-zadnica-i-tupaya-bashka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1430224643_1.jpg",
                "description": "Картман переодевает свою руку в Дженнифер Лопес для школьного представления. Однако шутка затягивается, и жиртрест начинает относится к своей руке, как к отдельной личности. Вскоре становится невозможно определить, прикалывается ли Картман, или действительно его рука превратилась в Дженнифер Лопес."
            },
            {
                "title": "7 сезон 6 серия: Маленькие борцы с преступностью",
                "url": "http://online-south-park.ru/season-7/148-7-sezon-6-seriya-malenkie-borcy-s-prestupnostyu.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1430228491_1.jpg",
                "description": "Пацаны увлекаются игрой в частных детективов. В полиции Саут-Парка обращают внимание на них и решают наградить значком юного полицейского. Ребята, можно сказать, становятся настоящими полицейскими. Поэтому шеф полиции решает нагрузить их по полной, давая им настоящее задание по поимке наркоторговцев..."
            },
            {
                "title": "7 сезон 7 серия: Алчность краснокожего",
                "url": "http://online-south-park.ru/season-7/149-7-sezon-7-seriya-alchnost-krasnokozhego.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1431085169_1.jpg",
                "description": "Отец Кайла просаживает 26000 долларов в казино \"Три пера\", принадлежащем индейцам. После этого ему приходится признать, что вскоре он будет вынужден продать свой дом и переехать в другое место.\nА вождь краснокожих, владеющий казино, решает проложить дорогу от Денвера до своего казино. По его плану дорога должна быть построена через Саус-Парк. Он решает выкупить городок и снести его, чтобы проложить шоссе..."
            },
            {
                "title": "7 сезон 8 серия: Педики Южного парка",
                "url": "http://online-south-park.ru/season-7/150-7-sezon-8-seriya-pediki-yuzhnogo-parka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1431086313_1.jpg",
                "description": "В Южном парке начинается мода на метросексуализм. Пацаны тоже подхватывают эту моду, но неправильно воспринимают её, стремясь выглядеть как можно педерастичнее. Кайл остаётся единственным, кто не желает быть метросексуалом. Из-за этого он становится изгоем."
            },
            {
                "title": "7 сезон 9 серия: Тяжёлый христианский рок",
                "url": "http://online-south-park.ru/season-7/151-7-sezon-9-seriya-tyazhelyy-hristianskiy-rok.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1431528242_1.jpg",
                "description": "Пацаны решают создать собственную музыкальную группу, но не могут определиться с направлением. Эрик предлагает играть христианский рок, потому что данный стиль становится очень популярным и позволит зарабатывать много денег, но остальным эта идея не понравилась. Поэтому Картман отделяется от них и основывает собственную группу, в состав которой вошли Баттерс и Токен..."
            },
            {
                "title": "7 сезон 10 серия: Седой рассвет",
                "url": "http://online-south-park.ru/season-7/152-7-sezon-10-seriya-sedoy-rassvet.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1431607021_1.jpg",
                "description": "По вине пожилых водителей в Саут-Парке гибнут жители города. Администрация города принимает решение изъять у стариков водительские права. Пожилые люди возмущены этим и обращаются в организацию по защите прав пенсионеров..."
            },
            {
                "title": "7 сезон 11 серия: Каса-Бонита",
                "url": "http://online-south-park.ru/season-7/153-7-sezon-11-seriya-kasa-bonita.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1431607489_1.jpg",
                "description": "Приближается день рождения Кайла. Он решает пригласить своих лучших друзей в Каса-Бониту. Всех, кроме Картмана, которого не считает своим другом. Вместо Эрика Кайл решает пригласить Баттерса. Жирдяй не может с этим смиряться, ведь Каса-Бонита - это один из его любимых парков развлечений. Поэтому Эрик придумывает хитрый план..."
            },
            {
                "title": "7 сезон 12 серия: Всё о мормонах",
                "url": "http://online-south-park.ru/season-7/154-7-sezon-12-seriya-vse-o-mormonah.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1431698598_1.jpg",
                "description": "В четвёртом классе появляется новичок. Его зовут Гэри. Он очень умный и излишне добрый. Пацанам он сразу же не понравился. На перемене Стэн решил врезать ему по яйцам, но не смог, поскольку Гэри \"подкупил\" его своей добротой и искренность. Они становятся друзьями, а Стэн узнаёт много нового о мормонах, к которым относится Гэри."
            },
            {
                "title": "7 сезон 13 серия: Завязывай",
                "url": "http://online-south-park.ru/season-7/155-7-sezon-13-seriya-zavyazyvay.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1431938283_1.jpg",
                "description": "Несколько молодых людей устраивают в школе представление о вреде курения. Они говорят, что если школьники не будут курить, то станут такими же успешными, как они. Кайл, Стэн, Картман и Кенни, посчитав тех отстойными, решают начать курить, чтобы не стать похожими на них. Это приводит к пожару. Вина за пожар ложится на табачные фабрики. В Саут-Парк приезжает Роб Райнер."
            },
            {
                "title": "7 сезон 14 серия: Изюминки",
                "url": "http://online-south-park.ru/season-7/156-7-sezon-14-seriya-izyuminki.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1431945588_1.jpg",
                "description": "Венди бросает Стэна. Друзья, чтобы приободрить его, приглашают его в ресторан \"Изюминки\", в котором официантками являются сексуально одетые девочки, которые заигрывают с клиентами. Это не поднимает настроение Стэну. В конечном итоге он становится готом и примыкает к известной в последующих сериях группе детей-готов.\nБаттерс же начинает считать, что у него начинаются отношения с одной из официанток просто потому, что она разговаривала и обнимала его."
            },
            {
                "title": "7 сезон 15 серия: Рождество в Канаде",
                "url": "http://online-south-park.ru/season-7/157-7-sezon-15-seriya-rozhdestvo-v-kanade.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-05/1432031779_1.jpg",
                "description": "На Рождество ребята отправляются в Канаду, чтобы вернуть брата Кайла, которого забрали биологические родители."
            }
        ],
        "number_of_episodes": 15
    },
    {
        "title": "Сезон 8",
        "url": "http://online-south-park.ru/season-8/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-08.jpg",
        "episodes": [
            {
                "title": "8 сезон 1 серия: Славные времена с оружием",
                "url": "http://online-south-park.ru/season-8/129-8-sezon-1-seriya-slavnye-vremena-s-oruzhiem.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428571165_1.jpg",
                "description": "На ярмарке пацаны покупают настоящее японское средневековое оружие и начинают представлять себя в образе ниндзя (мы их будем видеть нарисованными в стиле аниме). Ребята начинают хвастаться своим оружием перед Крейгом и отшивают Баттерса. Последний перевоплощается в профессора Хаоса и идёт на встречу с ними, чтобы поучаствовать в шутливой битве. Но в ходе этой шутливой драки Кенни случайно вонзает сюрикен Баттерсу в глаз..."
            },
            {
                "title": "8 сезон 2 серия: ШИКАРН-О",
                "url": "http://online-south-park.ru/season-8/130-8-sezon-2-seriya-shikarn-o.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428665809_1.jpg",
                "description": "Баттерс получает посылку с настоящим роботом ШИКАРН-О и очень радуется этому подарку от неизвестного отправителя. На самом деле роботом оказывается замаскированный Картман, решивший разыграть Баттерса и выведать у него личные секреты..."
            },
            {
                "title": "8 сезон 3 серия: Обратная сторона стероидов",
                "url": "http://online-south-park.ru/season-8/132-8-sezon-3-seriya-obratnaya-storona-steroidov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428672365_1.jpg",
                "description": "Джимми рассказывает, что вскоре он и Тимми будут участвовать в Олимпиаде для инвалидов и умственно-отсталых. Это подкидывает Картману отличную идею: притвориться умственно-отсталым и выиграть все призовые места. Эрик уверен, что инвалидов будет очень просто обыграть."
            },
            {
                "title": "8 сезон 4 серия: Страсти жидовы",
                "url": "http://online-south-park.ru/season-8/133-8-sezon-4-seriya-strasti-zhidovy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429001264_1.jpg",
                "description": "Картман в очередной раз подкалывает Кайла, потому что он  еврей. Эрик предлагает посмотреть ему фильм \"Страсти Христовы\", где евреи выставлены в негативном свете. Кайл смотрит и... соглашается во всём с Картманом. После этого жирдяй начинает боготворить Мела Гибсона за этот фильм и обязуется рассказать о фильме всем людям..."
            },
            {
                "title": "8 сезон 5 серия: Вас только что в'ли в ж'у",
                "url": "http://online-south-park.ru/season-8/134-8-sezon-5-seriya-vas-tolko-chto-vli-v-zhu.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429007761_1.jpg",
                "description": "Несколько ребят «сделали» Стэна, Кайла, Эрика и Кенни, станцевав перед ними. Последние вообще не поняли, что произошло. За ужином отец Стэна узнал, что его сына «сделали», после чего решил обучить его танцам, чтобы тот смог в следующий раз ответить. И Стэн смог станцевать в ответ при встрече с той группой пацанов, что привело к вызову его на танцевальный поединок."
            },
            {
                "title": "8 сезон 6 серия: Goobacks",
                "url": "http://online-south-park.ru/season-8/135-8-sezon-6-seriya-goobacks.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429103071_1.jpg",
                "description": "В Саут-Парк начинают прибывать люди из будущего в поисках работы. А всё потому, что в будущем жизнь очень трудна и найти работу очень трудно. И всё бы ничего, но из-за \"возвращенцев\" начинают лишаться работы жители Южного парка."
            },
            {
                "title": "8 сезон 7 серия: Джефферсоны",
                "url": "http://online-south-park.ru/season-8/136-8-sezon-7-seriya-dzheffersony.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429103984_1.jpg",
                "description": "Ребята замечают, что в один из пустующих домов заселилась семья, состоящая и отца и сына. Глава семьи представляется Майклом Джефферсоном. Очевидно, это Майкл Джексон, не желающий говорить своё настоящее имя. Пацаны очень сильно привязываются к нему, потому что у него дома очень много игр и игрушек, да и сам Джефферсон похож на ребёнка по поведению. Но вскоре Стэн и Кайл понимают, что у него с головой не всё в порядке."
            },
            {
                "title": "8 сезон 8 серия: Клизма и дерьмо",
                "url": "http://online-south-park.ru/season-8/137-8-sezon-8-seriya-klizma-i-dermo.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429175925_1.jpg",
                "description": "Школа Южного парка вынуждена отказаться от талисмана детской футбольной команды -- коровы. Причиной являются угрозы со стороны организации по защите животных, которая посчитала талисман-корову издевательским. Кайл предлагает в качестве нового талисмана гигантскую клизму, а Картман - сэндвич с дерьмом. Стэн, не видя смысла в выборе между клизмой и дерьмом, отказывается голосовать, что вызывает в его адрес приступы ненависти со стороны местного быдла."
            },
            {
                "title": "8 сезон 9 серия: Кое-что о том, как пришёл Wall-Mart",
                "url": "http://online-south-park.ru/season-8/138-8-sezon-9-seriya-koe-chto-o-tom-kak-prishel-wall-mart.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429180365_1.jpg",
                "description": "В Саут-Парке строят новый гипермаркет Wall-Mart (Уолл-Март / Воллмарт). Он очень нравится горожанам, но вскоре они понимают, что Уолл-Март воздействует на их жизнь, заставляя покупать всё больше и больше ненужных им товаров по низким ценам. Вскоре все принимают решение не ходить в новый гипермаркет, однако не всё так просто..."
            },
            {
                "title": "8 сезон 10 серия: Детский сад",
                "url": "http://online-south-park.ru/season-8/139-8-sezon-10-seriya-detskiy-sad.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429616722_1.jpg",
                "description": "Пацаны узнают, что из колонии для несовершеннолетних выходит Трент Бойетт, который угодил за решётку по их вине ещё в детском саду. Теперь Третт жаждет мести, а ребята придумывают способ защиты от него."
            },
            {
                "title": "8 сезон 11 серия: В погоне за рейтингами",
                "url": "http://online-south-park.ru/season-8/140-8-sezon-11-seriya-v-pogone-za-reytingami.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429617229_1.jpg",
                "description": "Стэн, Кайл, Эрик, Джимми, Токен и Баттерс работают над школьной телепередачей \"Школьные новости\". Но освещаемые ими события скучны и никому не интересны. Кроме того, по рейтингу их обходит шоу Крейга \"Звери крупным планом, снятые широкоугольным объективом\". Чтобы спасти свой проект, ребята переименовывают его в \"Боевые секси-новости\" и полностью меняют стиль."
            },
            {
                "title": "8 сезон 12 серия: Видеонабор тупой испорченной шлюхи",
                "url": "http://online-south-park.ru/season-8/141-8-sezon-12-seriya-videonabor-tupoy-isporchennoy-shlyuhi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429619359_1.jpg",
                "description": "Пэрис Хилтон открывает в Саут-Парке свой магазин, торгующий откровенными нарядами и вещами для девочек. После этого почти все девочки города начали превращаться в шлюх. Венди всерьёз обеспокоена этим, но её никто не слушает.\nПэрис Хилтон после открытия своего магазина собралась уезжать из города. На выезде её собака, уставшая терпеть тупую хозяйку, заканчивает свою жизнь самоубийством. Но Пэрис горевала не долго. Она заметила играющего около дороги Баттерса и решила сделать его своим новым домашним любимцем."
            },
            {
                "title": "8 сезон 13 серия: Удивительный дар Картмана",
                "url": "http://online-south-park.ru/season-8/146-8-sezon-13-seriya-udivitelnyy-dar-kartmana.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1429797604_1.jpg",
                "description": "Картман одевает деревянные крылья и прыгает с крыши дома, думая, что полетит. В результате он попадает в больницу с сотрясением. Около соседней кровати полицейские обсуждали серийного убийцу и обратили своё внимание на жирдяя, когда он угадал очевидные вещи. Полицейские посчитали, что Картман стал медиумом после удара головой о землю. Они решили использовать его дар, чтобы найти убийцу..."
            },
            {
                "title": "8 сезон 14 серия: Рождество у лесных зверушек",
                "url": "http://online-south-park.ru/season-8/260-8-sezon-14-seriya-rozhdestvo-u-lesnyh-zverushek.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-09/1443617289_1.jpg",
                "description": "В этой серии Стэн знакомится с милыми лесными зверятами. Они просят Стэна помочь им. Дело в том, что Ежиха вот-вот должна родить их Спасителя, но Пума может убить его. Стэн соглашается помочь им. Он убивает Пуму. Зверята счастливы, ведь теперь Ежиха родит Спасителя. Но оказалось, что этим Спасителем является далеко не дитя света. Да и лесные зверята - это далеко не представители добра."
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 9",
        "url": "http://online-south-park.ru/season-9/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-09.jpg",
        "episodes": [
            {
                "title": "9 сезон 1 серия: Новая модная вагина мистера Гаррисона",
                "url": "http://online-south-park.ru/season-9/117-9-sezon-1-seriya-novaya-modnaya-vagina-mistera-garrisona.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1427982076_1.jpg",
                "description": "Кайл мечтает стать баскетболистом, но его мечтам не суждено сбыться, потому что он недостаточно высокий и недостаточно чёрный. А мистер Гаррисон меняет свой пол и становится женщиной. Это подбадривает Кайла, ведь если делается операция по смене пола, то должна быть операция по превращению маленьких белых людей в высоких афроамериканцев."
            },
            {
                "title": "9 сезон 2 серия: Сдохни, хиппи, сдохни",
                "url": "http://online-south-park.ru/season-9/118-9-sezon-2-seriya-sdohni-hippi-sdohni.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428063571_1.jpg",
                "description": "Картман, борющийся с хиппи, замечает, что их с каждым днём становится всё больше и больше. За свои радикальные действия в отношении хиппи Эрик попадает в тюрьму.\nА мэр Саут-Парка подписывает разрешение на проведение фестиваля хиппи в своём городе. Она ещё не подозревает, чем это грозит..."
            },
            {
                "title": "9 сезон 3 серия: Винг",
                "url": "http://online-south-park.ru/season-9/119-9-sezon-3-seriya-ving.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428069305_1.jpg",
                "description": "4 главных героя мультсериала узнают, что Токен будет петь на конкурсе красоты, за что получит 200 долларов. Поэтому ребята стараются стать его агентами, чтобы поучить процент от его доходов. Им это удаётся, но вскоре другое агентство переманивает Токена к себе. Ребята уже отчаялись, но их выручает владелецгавнючегоресторана Гань Вань Чи, который хочет сделать известной свою жену Винг и случайно натыкается на объявление ребят."
            },
            {
                "title": "9 сезон 4 серия: Лучшие друзья навсегда",
                "url": "http://online-south-park.ru/season-9/120-9-sezon-4-seriya-luchshie-druzya-navsegda.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428319670_1.jpg",
                "description": "Кенни покупает PSP и подсаживается на игру \"Рай против ада\". Вскоре он, увлечённый игрой, попадает под колёса автомобиля и погибает. Кенни попадает в рай и узнаёт, что PSP была придумана Богом, чтобы определить смертного, который смог бы вести войска рая против демонов преисподней. Но в самый последний момент врачам удаётся реанимировать Кенни в больнице..."
            },
            {
                "title": "9 сезон 5 серия: Всё ради поражения",
                "url": "http://online-south-park.ru/season-9/121-9-sezon-5-seriya-vse-radi-porazheniya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428322571_1.jpg",
                "description": "Ребята не хотят тратить лето на участие в бейсбольном турнире. Их отцы, напротив, мечтают, чтоб их дети стали чемпионами. Поэтому ребята стараются проиграть в бейсбольном матче, чтобы выбыть из турнира и начать отдыхать. Но какого было их удивление, когда они узнали, что все остальные команды тоже работают на своё поражение!"
            },
            {
                "title": "9 сезон 6 серия: Смерть Эрика Картмана",
                "url": "http://online-south-park.ru/season-9/122-9-sezon-6-seriya-smert-erika-kartmana.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428403540_1.jpg",
                "description": "Мама Стэна покупает куриные крылышки. Пока Стэн, Кайл и Кенни помогали ей, Картман съел всю кожицу с крылышек. За это ребята решают игнорировать его. Эрик же, заметив, что все его игнорируют, решает, что он умер, но по какой-то причине застрял на Земле..."
            },
            {
                "title": "9 сезон 7 серия: День эрекции",
                "url": "http://online-south-park.ru/season-9/123-9-sezon-7-seriya-den-erekcii.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428404587_1.jpg",
                "description": "Приближается конкурс талантов. Джимми, несмотря на подготовленный номер, боится участвовать, поскольку у него стали происходить спонтанные эрекции из-за взросления, что будет заметно на сцене. Баттерс оказывается единственным, кому Джимми может доверить свою проблему, не боясь быть высмеянным. Баттерс ему рассказывает, что для снятия напряжения нужно заняться сексом..."
            },
            {
                "title": "9 сезон 8 серия: За два дня до послезавтра",
                "url": "http://online-south-park.ru/season-9/124-9-sezon-8-seriya-za-dva-dnya-do-poslezavtra.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428405205_1.jpg",
                "description": "Стэн и Картман угоняют чужой катер, чтобы покататься. Случайно они пробивают бобровую плотину, что становится причиной затопления города Бивертон. Но учёные утверждают, что причиной затопления стало глобальное потепление. Кстати, также учёные утверждают, что глобальное потепление накроет целиком штат Колорадо, и это случится за 2 дня до послезавтра."
            },
            {
                "title": "9 сезон 9 серия: Марджорин",
                "url": "http://online-south-park.ru/season-9/125-9-sezon-9-seriya-mardzhorin.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428413191_1.jpg",
                "description": "Картман обнаруживает, что его одноклассницы предсказывают друг другу будущее при помощи странного прибора. На самом деле этим прибором был обычный лист бумаги, сложенный особым образом, а девочки просто играли. Тем не менее, все ребята поверили в мистическую сущность прибора и захотели выкрасть. Для этого они решают переодеть Баттерса в девочку, чтобы он втёрся в доверие девчёнок..."
            },
            {
                "title": "9 сезон 10 серия: Следи за яйцом",
                "url": "http://online-south-park.ru/season-9/126-9-sezon-10-seriya-sledi-za-yaycom.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428494239_1.jpg",
                "description": "Четвероклассники получают от миссис Гаррисон задание, согласно которому они разбиваются на пары мальчик+девочка и следят за куриным яйцом, которое символизирует ребёнка. Разбитое яйцо = мёртвый ребёнок = двойка в журнал.\nВскоре миссис Гаррисон решает восстановить отношения с мистером Мазохистом, но узнаёт, что последний собирается жениться на Эле-гомосеке. Гаррисон не может это допустить и придумывает план, чтобы запретить свадьбы гомосексуалистов в Колорадо..."
            },
            {
                "title": "9 сезон 11 серия: Рыжие дети",
                "url": "http://online-south-park.ru/season-9/127-9-sezon-11-seriya-ryzhie-deti.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428495352_1.jpg",
                "description": "На уроке Картман зачитывает ученикам свой доклад, призывающий ненавидеть рыжих детей. Как и следовало ожидать, по вине жирдяя рыжие дети становятся изгоем. Кайл решает проучить его. Вместе со Стэном и Кенни он пробирается ночью в дом Эрика и перекрашивает его волосы в рыжий цвет..."
            },
            {
                "title": "9 сезон 12 серия: Застрявший в чулане",
                "url": "http://online-south-park.ru/season-9/128-9-sezon-12-seriya-zastryavshiy-v-chulane.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428499677_1.jpg",
                "description": "После прохождения специального тестасектантовсаентологов Стэну стало известно, что он, якобы, несчастен и находится в депрессии. Но всего-лишь за $240 саентология готова ему помочь. Стэн платит деньги и проходит ещё один тест по измерению тэтан-уровня (это такой показатель у саентологов). Результаты шокируют всех окружающих: судя по всему, Стэн - это реинкарнация сэра Л. Рона Хаббарда, основателя саентологии."
            },
            {
                "title": "9 сезон 13 серия: Освободите Виллзиака",
                "url": "http://online-south-park.ru/season-9/131-9-sezon-13-seriya-osvobodite-villziaka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1428666032_1.jpg",
                "description": "В дельфинарии кит начинает общаться с ребяами, когда остальные люди разошлись. Пацаны узнают от кита, что его зовут Виллзиак, он родом с Луны, а здесь его держат насильно. Ребята ещё не знают, что это розыгрыш, устроенный сотрудниками дельфинария. Тем не менее, они настроены решительно. Ночью они похищают кита с целью его освобождения."
            },
            {
                "title": "9 сезон 14 серия: Кровавая Мэри",
                "url": "http://online-south-park.ru/season-9/272-9-sezon-14-seriya-krovavaya-meri.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-06/1466251716_1.jpg",
                "description": "Одна из серий, запрещённых к показу в России. А это значит, что MTV (Paramount Comedy) не переводили эту серию.\nРэнди отвозит детей на занятия по каратэ, а после развозит их по домам. На обратном пути он напивается и его останавливает полицейский. Разумеется, Рэнди в стельку пьян, и его приговаривают к посещению клуба анонимных алкоголиков. Там он буквально понимает, что алкоголизм - это болезнь. Вместо того, чтобы завязать с пьянством, он продолжает бухать, жалея себя и оплакивая свою болезнь."
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 10",
        "url": "http://online-south-park.ru/season-10/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-10.jpg",
        "episodes": [
            {
                "title": "10 сезон 1 серия: Возвращение Шефа",
                "url": "http://online-south-park.ru/season-10/100-10-sezon-1-seriya-vozvraschenie-shefa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427199744_1.jpg",
                "description": "Шеф, уехавший из Саус-Парка, чтобы найти своё место в жизни, возвращается назад и рассказывает, что он вступил в супер-клуб путешественников и ездил по миру. Но после своего возвращения в Саус-Парк Шеф очень изменился. Он превратился в педофила и начал намекать детям на секс..."
            },
            {
                "title": "10 сезон 2 серия: Угроза самодовольства",
                "url": "http://online-south-park.ru/season-10/101-10-sezon-2-seriya-ugroza-samodovolstva.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427206645_1.jpg",
                "description": "Джеральд (отец Кайла) покупает автомобиль гибрид, который намного безопаснее для окружающей среды. После этого Джеральд начинает считать себя лучше остальных и становится очень пафосным. Не желая смиряться с тем, что больше никто в городе не планирует покупать гибрид, отец Кайла принимает решение переехать всей семьёй в Сан-Франциско..."
            },
            {
                "title": "10 сезон 3 серия: Мультипликационные войны. Часть I",
                "url": "http://online-south-park.ru/season-10/104-10-sezon-3-seriya-multiplikacionnye-voyny-chast-i.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427452381_1.jpg",
                "description": "В новостях рассказывают, что в ближайшее время по ТВ будет показана серия мультсериала \"Гриффины\", в которой будет показан пророк Мухаммед. Это может вызвать террористический акт возмездия от мусульман. В городах начинается паника...\nКартман же планирует уговорить руководство канала FOX снять эту серию \"Гриффинов\" с эфира. Он просит помочь ему Кайла, говоря, что могут погибнуть люди. Но действительно ли жирдяй хочет снять серию \"Гриффинов\" с Мухаммедом ради спасения людей?"
            },
            {
                "title": "10 сезон 4 серия: Мультипликационные войны. Часть II",
                "url": "http://online-south-park.ru/season-10/105-10-sezon-4-seriya-multiplikacionnye-voyny-chast-ii.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427791255_1.jpg",
                "description": "Вторая часть дилогии \"Мультипликационные войны\".\nКартман приезжает в Голливуд, чтобы переговорить с руководством канала FOX с целью снятия с эфира серии \"Гриффинов\" про Мухаммеда. Там он встречает Барта Симпсона, который прибыл сюда с этой же целью."
            },
            {
                "title": "10 сезон 5 серия: Миллион маленьких волокон",
                "url": "http://online-south-park.ru/season-10/106-10-sezon-5-seriya-million-malenkih-volokon.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427793312_1.jpg",
                "description": "Эта серия Южного парка целиком посвящена Полотенчику, который решил написать книгу. Он планирует завязать с курением травки и стать великим писателем. Но для начала ему придётся поменять своё имя, поскольку полотенце не может стать писателем."
            },
            {
                "title": "10 сезон 6 серия: Челмедведосвин",
                "url": "http://online-south-park.ru/season-10/107-10-sezon-6-seriya-chelmedvedosvin.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427796855_1.jpg",
                "description": "Бывший вице-президент Эл Гор обеспокоен величайшей проблемой человечества, существом по имени Челмедведосвин. Никто не обращает внимания на Эла Гора, поскольку понимают, что при помощи Челмедведосвина он просто хочет привлечь к себе внимание. Однако ребята из чувства сострадания подыгрывают бывшему вице-президенту."
            },
            {
                "title": "10 сезон 7 серия: Цццт",
                "url": "http://online-south-park.ru/season-10/108-10-sezon-7-seriya-ccct.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427797753_1.jpg",
                "description": "После последней выходки Картмана его мать решает обратиться за помощью на шоу \"Супер няня\". После того, как Эрик доводит нескольких нянь \"до ручки\", его мать в порыве отчаяния обращается к дрессировщику собак. Сезар (так его зовут) начинает воспитывать Эрика в том же стиле, в котором дрессирует собак."
            },
            {
                "title": "10 сезон 8 серия: Занимайтесь любовью, а не Варкрафтом",
                "url": "http://online-south-park.ru/season-10/110-10-sezon-8-seriya-zanimaytes-lyubovyu-a-ne-varkraftom.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427801127_1.jpg",
                "description": "У четвероклассников новое увлечение - World of WarCraft. Но ребят в игре постоянно убивает некий персонаж, которому удаётся обойти правила игры. Стэн, Кайл и Кенни решают забросить \"Варкрафт\", но Картман призывает их не сдаваться, засесть в лесу и прокачивать своих персонажей, убивая вепрей..."
            },
            {
                "title": "10 сезон 9 серия: Загадка о говне в писсуаре",
                "url": "http://online-south-park.ru/season-10/111-10-sezon-9-seriya-zagadka-o-govne-v-pissuare.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1427885555_1.jpg",
                "description": "Какой-то школьник насрал в школьный писсуар. Мистер Маки вызывает полицию, чтобы расследовать это преступление. Но только братья Хардли способны разгадать тайну говна в писсуаре.\nКартман же расследует дело о теракте 11 сентября. Он приходит к выводу, что в этом замешан... Кайл."
            },
            {
                "title": "10 сезон 10 серия: Учительница соблазняет мальчика",
                "url": "http://online-south-park.ru/season-10/112-10-sezon-10-seriya-uchitelnica-soblaznyaet-malchika.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1427885851_1.jpg",
                "description": "Картман становится школьным дежурным по коридорам. Опьянённый своей властью, жиртрест делает замечания всем ученикам по малейшей провинности и даже снимает клип про себя. Вскоре он жалуется учительнице детского сада на Айка, который выронил в коридоре листок с рисунком. Учительница понимает, что Айк влюблён в неё. У них начинается настоящий роман."
            },
            {
                "title": "10 сезон 11 серия: Ад на Земле 2006",
                "url": "http://online-south-park.ru/season-10/113-10-sezon-11-seriya-ad-na-zemle-2006.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1427887263_1.jpg",
                "description": "Приближается Хэллоуин 2006. Сатана решает устроить особую вечеринку, куда приглашает многих жителей ада.\nРебята же пытаются вызвать дух Бигги Смоллза, погибшего рэппера-афроамериканца."
            },
            {
                "title": "10 сезон 12 серия: Вперёд, Бог, вперёд",
                "url": "http://online-south-park.ru/season-10/114-10-sezon-12-seriya-vpered-bog-vpered.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1427889719_1.jpg",
                "description": "Картман ждёт выхода новой приставки Nintendo Wii. Не в силах ждать больше, жирдяй просит Баттерса заморозить его. Это приводит к тому, что Эрик оказывается в далёком будущем в 2546 году.\nТем временем в школе Южного парка по новой школьной программе начинается преподавание теории эволюции. Миссис Гаррисон категорически против этого..."
            },
            {
                "title": "10 сезон 13 серия: Вперёд, Бог, вперёд XII",
                "url": "http://online-south-park.ru/season-10/115-10-sezon-13-seriya-vpered-bog-vpered-xii.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1427980972_1.jpg",
                "description": "Продолжение дилогии South Park, в которой Картман попал в будущее.\nЭрик наконец-то получает приставку Nintendo Wii, которая находилась в заброшенном музее. Однако консоль невозможно подключить к телевизорам будущего. Разъярённый Картман придумывает способ как избежать своего замораживания и попадания в будущее..."
            },
            {
                "title": "10 сезон 14 серия: Кубок Стэнли",
                "url": "http://online-south-park.ru/season-10/116-10-sezon-14-seriya-kubok-stenli.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-04/1427981452_1.jpg",
                "description": "Стэну приходится стать тренером детской хоккейной команды, чтобы заработать денег, оплатить штрафы и вернуть свой велосипед. В детской команде есть мальчик, больной лейкемией. Вскоре он попадает в больницу и надеется, что его хоккейная команда победит."
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 11",
        "url": "http://online-south-park.ru/season-11/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-11.jpg",
        "episodes": [
            {
                "title": "11 сезон 1 серия: Извинения перед Джесси Джексоном",
                "url": "http://online-south-park.ru/season-11/89-11-sezon-1-seriya-izvineniya-pered-dzhessi-dzheksonom.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1426163311_1.jpg",
                "description": "Рэнди доходит до финала программы \"Поле Чудес\", где на табло ему нужно отгадать тип людей, которые всех раздражают. Слово почти открыто, на табло - N_GGERS. Рэнди предполагает, что ответом является \"ниггеры\" и позорится на всю страну, ведь ответом является \"зануды\", то есть, \"naggers\". После этого над Рэнди начинают повсюду смеяться.\nТем временем в школе решают провести занятие по политкорректности и вежливости. На занятие приглашают мужчину с очень низким ростом. Картман не может сдерживаться и высмеивает его..."
            },
            {
                "title": "11 сезон 2 серия: Картман сосёт",
                "url": "http://online-south-park.ru/season-11/95-11-sezon-2-seriya-kartman-soset.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1426767593_0.jpg",
                "description": "Картман очень часто приглашает Баттерса к себе, якобы, чтобы поиграть со своим лучшим другом. На самом деле он фотографирует Баттерса в нелепых позах, пока тот спит у него дома. Но в последний Эрик сфоткал Баттерса, взяв его член себе в рот. Жирдяй подумал, что таким образом Баттерс будет считаться геем. Но Кайл ему открыл глаза, сказав, что теперь геем является он. Но \"гейство\" будет отменено, если Баттерс возьмёт в рот член Картмана. Во время подготовки к этому их \"спалили\". Отец Баттерса решил, что у его сына имеются гомосексуальные наклонности, и отправил его в специальный лагерь..."
            },
            {
                "title": "11 сезон 3 серия: Вшивые приключения",
                "url": "http://online-south-park.ru/season-11/96-11-sezon-3-seriya-vshivye-priklyucheniya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1426775652_1.jpg",
                "description": "Четвероклассники проходят проверку на наличие вшей. Чуть позже от миссис Гаррисон они узнают, что вши были найдены, однако имя ученика или учеников по понятным причинам не будет разглашено. Ребята планируют найти \"вшивого\", чобы проучить его. Клайд очень волнуется, ведь у него были найдены эти мелкие паразиты...\nВторая часть серии посвящена мирной жизни вшей, которые живут у Клайда на голове."
            },
            {
                "title": "11 сезон 4 серия: Пизбомба",
                "url": "http://online-south-park.ru/season-11/97-11-sezon-4-seriya-pizbomba.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1426853338_1.jpg",
                "description": "В 4 классе появляется новый ученик по имени Бахир Хаким. Это настораживает Картмана, который убеждён, что все мусульмане - террористы. Жирдяй быстро звонит Кайлу, который в этот момент болеет, и просит его узнать как можно больше информации о новом ученике.\nВ Саус-Парке планируется выступление Хиллари Клинтон. Эрик приходит к выводу, что Бахир может быть замешан в организации террористического акта на выступлении. Разумеется, Бахир ничего не планирует, однако Картман оказывается прав, как минимум, в том, что террористический акт, действительно, готовится."
            },
            {
                "title": "11 сезон 5 серия: Чудесная пасхальная история",
                "url": "http://online-south-park.ru/season-11/98-11-sezon-5-seriya-chudesnaya-pashalnaya-istoriya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427118588_1.jpg",
                "description": "Стэн начинает интересоваться Пасхой. Ему хочется знать, почему люди на Пасху красят яйца, которые вообще не связаны с Иисусом. Вскоре на Стэна начинают охотиться люди, одетые в костюмы кроликов. Оказывается, что существует тайное сообщество пасхальных кроликов, и Стэну не стоило совать нос куда не следует. Но, поскольку Рэнди как раз состоял в этом сообществе, то Стэна решили принять туда и объяснить, что к чему. В момент посвящения происходит нападение..."
            },
            {
                "title": "11 сезон 6 серия: D-Yikes!",
                "url": "http://online-south-park.ru/season-11/99-11-sezon-6-seriya-d-yikes.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427119328_1.jpg",
                "description": "У миссис Гаррисон по-прежнему не клеятся свидания с мужчинами. Однажды она вслух злится на мужиков, находясь в фитнес-центре. Там её подслушивает женщина и решает, что Гаррисон - лесбиянка. Вскоре они вместе идут в лесбийский бар Les Bos, и миссис Гаррисон принимает свою новую сексуальную ориентацию..."
            },
            {
                "title": "11 сезон 7 серия: Ночь живых бомжей",
                "url": "http://online-south-park.ru/season-11/102-11-sezon-7-seriya-noch-zhivyh-bomzhey.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427368832_0.jpg",
                "description": "Многие жители Южного парка замечают, что на улицах их города становится всё больше и больше бомжей. Однажды Кайл даёт бездомному 20 долларов, а на следующий день весь город буквально кишит бомжами. Ребята начинают обвинять Кайла, что это его вина..."
            },
            {
                "title": "11 сезон 8 серия: Синдром Туррета",
                "url": "http://online-south-park.ru/season-11/103-11-sezon-8-seriya-sindrom-turreta.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427371752_1.jpg",
                "description": "Картман узнаёт, что существует синдром Туретта. Люди, страдающие этим синдромом, имеют различные нервные тики, среди которых невозможность сдерживать ругательства. Жирдяй решает притвориться, что у него синдром Туретта, чтобы безнаказанно материться."
            },
            {
                "title": "11 сезон 9 серия: Больше дерьма",
                "url": "http://online-south-park.ru/season-11/109-11-sezon-9-seriya-bolshe-derma.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1427798963_1.jpg",
                "description": "Рэнди уже на протяжении нескольких дней мучает запор. В итоге ему удаётся высрать столь огромный кусок дерьма, что он начинает хвастаться им перед друзьями. Благодаря этому куску говна Рэнди становится новым рекордсменом. Но его радость длилась не долго..."
            },
            {
                "title": "11 сезон 10 серия: Воображляндия",
                "url": "http://online-south-park.ru/season-11/245-11-sezon-10-seriya-voobrazhlyandiya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-08/1438860968_0.jpg",
                "description": "Первый эпизод знаменитой трилогии \"Воображляндия\". Здесь ребята выслеживают леприкона и таки ловят его. Оказалось, что леприкон спешил в страну Воображляндию с важной новостью, а теперь из-за пацанов он туда не попадёт вовремя и настанет конец.\nКартман же говорит Кайлу, что тот обязан сосать его яйца в соответствии с договором о леприконе..."
            },
            {
                "title": "11 сезон 11 серия: Воображляндия, эпизод II",
                "url": "http://online-south-park.ru/season-11/246-11-sezon-11-seriya-voobrazhlyandiya-epizod-ii.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-08/1438863223_1.jpg",
                "description": "Вторая часть трилогии \"Воображляндия\", или в другом переводе \"Воображеньеленд\".\nПридуманные злые существа оказались на свободе. Кайла и Стэна допрашивают люди из Пентагона. Картман путешествует автостопом, держа путь к Кайлу. Баттерс же продолжает оставаться в стране воображения."
            },
            {
                "title": "11 сезон 12 серия: Воображляндия, эпизод III",
                "url": "http://online-south-park.ru/season-11/251-11-sezon-12-seriya-voobrazhlyandiya-epizod-iii.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-08/1439973187_1.jpg",
                "description": "Третий эпизод про Воображляндию, завершающий данную трилогию.\nПосле случая с Челмедведосвином Кайл попадает в больницу, а Стэна засасывает в Воображляндию. Эрик по-прежнему не может оставить в покое свои яйца и Кайла. Правительство же планирует сбросить атомную бомбу на страну воображения."
            },
            {
                "title": "11 сезон 13 серия: Гитараст",
                "url": "http://online-south-park.ru/season-11/255-11-sezon-13-seriya-gitarast.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-09/1441202574_1.jpg",
                "description": "Кайл и Стэн (как и все ребята Южного парка) увлекаются игрой Guitar Hero. Они играют лучше всех, и их друзья с интересом наблюдают за успехами и рекордами дуэта. Вскоре в дом Маршей стучится агент и предлагает контракт ребятам. Теперь они - новые звёзды Guitar Hero. Но вскоре Кайла заменяет другой пацан.\nРэнди же понять не может: почему всем нравится Guitar Hero, но никто не хочет научиться играть на настоящей гитаре?"
            },
            {
                "title": "11 сезон 14 серия: Список",
                "url": "http://online-south-park.ru/season-11/256-11-sezon-14-seriya-spisok.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-09/1442235765_1.jpg",
                "description": "Ученицы 4 класса составляют список самых симпатичных мальчиков их класса. Вскоре пацанам удаётся достать тот список, и они узнают, что на 1 месте находится Клайд. На последнем 16 месте в списке находится Кайл. Он не может понять, почему девочки сочли его самым уродливым. Постепенно Кайл начинает сходить с ума."
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 12",
        "url": "http://online-south-park.ru/season-12/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-12.jpg",
        "episodes": [
            {
                "title": "12 сезон 1 серия: Проблема с гландами",
                "url": "http://online-south-park.ru/season-12/72-12-sezon-1-seriya-problema-s-glandami.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424773477_1.jpg",
                "description": "Во время операции на гландах Картмана случайно заражают ВИЧ. Это вскоре становится известно всем его друзьям. Кайл втайне радуется этому, ведь в коем-то веке Картман получил по заслугам. Но жирдяй решает преподать Кайлу урок и заражает его ВИЧ. Теперь им предстоит найти лекарство от СПИДа..."
            },
            {
                "title": "12 сезон 2 серия: Новая внешность Бритни",
                "url": "http://online-south-park.ru/season-12/73-12-sezon-2-seriya-novaya-vneshnost-britni.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424775495_1.jpg",
                "description": "В Южный парк на некоторое время приезжает Бритни Спирс, которая надеется, что хоть в этом маленьком городке ей не будут докучать люди с фотоаппаратами и камерами. Но, поскольку за фотографии Бритни дают приличное вознаграждение, то и здесь ей не спрятаться от папарацци. Среди них как раз были ребята, которые решили заработать на фотографиях поп-звезды. Увидев их и поняв, что от неё никогда не отстанут, Бритни стреляет себе в голову, но... выживает."
            },
            {
                "title": "12 сезон 3 серия: Внушительные буфера",
                "url": "http://online-south-park.ru/season-12/75-12-sezon-3-seriya-vnushitelnye-bufera.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424852597_0.jpg",
                "description": "Дети и подростки Саус-Парка начинают увлекаться вдыханием кошачьей мочи, что приводит к появлению галлюцинаций. Это занятие является наркоманией, и Кенни подсаживается на кошачью мочу. Он видит галлюцинации, в которых попадает в другой мир, в котором жители поклоняются пышным грудям. Там он встречает принцессу с большими сиськами..."
            },
            {
                "title": "12 сезон 4 серия: Канада бастует",
                "url": "http://online-south-park.ru/season-12/76-12-sezon-4-seriya-kanada-bastuet.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424863854_1.jpg",
                "description": "После того, как День поддержки Канады был высмеян в Америке, Президент Всемирного Канадского Бюро предлагает всем жителям Канады бастовать. Но абсолютно всему миру плевать на их забастовку. И лишь четверо ребят собираются снять популярное видео, выложить его на YouTube, заработать на нём денег и отдать их канадцам, чтобы те прекратили забастовку."
            },
            {
                "title": "12 сезон 5 серия: Фу, член!",
                "url": "http://online-south-park.ru/season-12/80-12-sezon-4-seriya-fu-chlen.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1425369029_1.jpg",
                "description": "Гаррисон вновь хочет стать мужчиной. К его счастью, по ТВ показывают программу, в которой ученые рассказывают о возможности выращивания человеческих органов на мышах. Гаррисон считает, что таким образом можно вырастить член для него. Это удаётся, но мышь сбегает...\nТем временем Картман замещает учителя для своего класса.  Удивительно, но все ученики начинают показывать отличные результаты на контрольной. Поэтому Эрика назначают учителем для класса трудных подростков из неблагополучного района."
            },
            {
                "title": "12 сезон 6 серия: Конец соединения",
                "url": "http://online-south-park.ru/season-12/82-12-sezon-6-seriya-konec-soedineniya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1425385529_1.jpg",
                "description": "В Саус-Парке у всех пропадает интернет. Вскоре становится понятно, что интернет пропал у всех жителей США. Семья Марш упаковывают вещи и отправляются в Калифорнию, ведь, по слухам, это единственный \"оазис\", где ещё есть интернет у людей."
            },
            {
                "title": "12 сезон 7 серия: Улетное время",
                "url": "http://online-south-park.ru/season-12/83-12-sezon-7-seriya-uletnoe-vremya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1425390471_1.jpg",
                "description": "Школьники четвёртого класса отправляются на экскурсию в деревню, воссоздающую эпоху 1864 года. Все работники этой деревни играют роль людей, живших в позапрошлом веке. Поэтому они притворяются, что не знают, что такое автомобиль, телефон и прочие вещи современности.\nВскоре на деревню нападают преступники, ограбившие только что бургерную. Несмотря на угрозу от преступников, работники деревни не выходят из своих ролей, следуя главному принципу и правилу их работы."
            },
            {
                "title": "12 сезон 8 серия: Китайская пробрема",
                "url": "http://online-south-park.ru/season-12/86-12-sezon-8-seriya-kitayskaya-probrema.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1425479109_1.jpg",
                "description": "После просмотра открытия летней олимпиады в Пекине Картман начал думать, что вскоре китайцы захватят весь мир. Эрик просит Баттерса помочь ему. Они переодеваются в стереотипных китайцев и отправляются в местный китайский ресторан, чтобы выудить у китайцев планы по захвату мира.\nТем временем остальные ребята обеспокоены тем, что Индиану Джонса изнасиловали Стивен Спилберг и Джордж Лукас."
            },
            {
                "title": "12 сезон 9 серия: Шоу о раке груди",
                "url": "http://online-south-park.ru/season-12/87-12-sezon-9-seriya-shou-o-rake-grudi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1425973198_1.jpg",
                "description": "Венди решает вызвать Картмана на драку после того, как Эрик неоднократно насмехался над её докладом и над женщинами, больными раком груди. Теперь жирдяй обеспокоен тем, что Венди его изобьёт. Картман предпринимает различные методы, чтобы избежать драки, но остаться крутым в глазах одноклассников."
            },
            {
                "title": "12 сезон 10 серия: Пандемия",
                "url": "http://online-south-park.ru/season-12/90-12-sezon-10-seriya-pandemiya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1426598806_1.jpg",
                "description": "Ребята замечают что в городе огромной популярностью начинает пользоваться перуанская музыка. Перуанские группы неплохо зарабатывают, продавая свои диски. Поэтому ребята агитируют Крэйга, котором бабушка подарила $100, купить музыкальные инструменты и начатьзарабатывать бабловыступать.\nА тем временем в правительстве всерьёз обеспокоились распространением перуанских групп. Начинаются их массовые аресты. Ребят вместе с Крэйгом тоже арестовывают..."
            },
            {
                "title": "12 сезон 11 серия: Пандемия 2: Потрясение",
                "url": "http://online-south-park.ru/season-12/91-12-sezon-11-seriya-pandemiya-2-potryasenie.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1426599444_0.jpg",
                "description": "В данной серии South Park продолжают разворачиваться события предыдущего эпизода. На город нападают гигантские морские свинки. Ребята оказываются в Перу и узнают, что ключом к спасению людей является..."
            },
            {
                "title": "12 сезон 12 серия: О прошлой ночи",
                "url": "http://online-south-park.ru/season-12/92-12-sezon-12-seriya-o-proshloy-nochi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1426685006_1.jpg",
                "description": "Многие жители Саус-Парка празднуют победу Барака Обамы на выборах. Другие (кто голосовал за МакКейна) готовятся к апокалипсису из-за победы не их кандидата. Начинается хаос по всей стране. Но на это как раз и рассчитывали новоизбранный президент, МакКейн и несколько других человек, которые заготовили план..."
            },
            {
                "title": "12 сезон 13 серия: Мюзикл начальной школы",
                "url": "http://online-south-park.ru/season-12/93-12-sezon-13-seriya-myuzikl-nachalnoy-shkoly.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1426687195_1.jpg",
                "description": "После просмотра \"Школьного мюзикла\" практически все ученики становятся помешанными на танцах. Масло в огонь подливает третьеклассник Брайден, который занимается танцами и нравится всем девчёнкам. Стэн, Кайл, Эрик и Кенни, наблюдая за постоянным песнопением, решают посмотреть Классный мюзикл\". Их чуть-ли не выворачивает наизнанку от увиденного. Ребята клянутся, что никогда не станут поющими придурками."
            },
            {
                "title": "12 сезон 14 серия: Ненаказуемый",
                "url": "http://online-south-park.ru/season-12/94-12-sezon-14-seriya-nenakazuemyy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1426688996_1.jpg",
                "description": "В школе набирает обороты субкультура вампиров: ученики одеваются в темную одежду, вставляют клыки и пьют томатный сок (типа, кровь). Наивный Баттерс считает, что это настоящие вампиры. Он пытается донести до друзей это, но его никто не слушает. Дома отец его тоже не слушает и наказывает. Разочаровавшись в людях, Баттерс решает примкнуть к вампирам и стать одним из них."
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 13",
        "url": "http://online-south-park.ru/season-13/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-13.jpg",
        "episodes": [
            {
                "title": "13 сезон 1 серия: Кольцо",
                "url": "http://online-south-park.ru/season-13/61-13-sezon-1-seriya-kolco.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424085993_1.jpg",
                "description": "У Кенни появляется подружка. Вскоре он узнаёт, что Тэмми (так зовут девочку) является девицей лёгкого поведения. Но Кенни это даже нравится. Тэмми рассказывает ему, что в её легком поведении виновата группа Jonas Brothers. Когда она видит их выступление, то у неё начинается течка, и она ничего с собой поделать не может. Поэтому Кенни покупает 2 билета на концерт этой группы в надежде получить оральное удовлетворение прямо во время их выступления. Но на этом концерте группа Jonas Brothers почему-то пропагандирует воздержание и кольца чистоты..."
            },
            {
                "title": "13 сезон 2 серия: Енот",
                "url": "http://online-south-park.ru/season-13/62-13-sezon-2-seriya-enot.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424089552_1.jpg",
                "description": "Картман придумывает нового супергероя и переодевается в него. Теперь он - Енот, супергерой, стоящий на страже города. Но никто всерьёз не воспринимает Картмана, что очень сильно его злит.\nСпустя некоторое время Картман (точнее, Енот) на крыше замечает другого супергероя, скрывающего лицо. Неизвестный представляется Мистерионом и говорит, что он является защитником Саус-Парка. Начинается конфликт между Енотом и Мистерионом."
            },
            {
                "title": "13 сезон 3 серия: Маргаритавилль",
                "url": "http://online-south-park.ru/season-13/65-13-sezon-3-seriya-margaritavill.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424183946_1.jpg",
                "description": "Начинается экономический кризис. Рэнди, попивая коктейль Маргарита, полученный при помощи дорогой соковыжималки, пытается донести до Стэна, что причиной кризиса является растранжиривание денег. Поэтому Стэн решает вернуть ту самую соковыжималку в магазин...\nПозже Рэнди предлагает жителям Саус-Парка способ выхода из кризиса: нужно максимально экономить деньги. Из-за этого все перестают ходить по магазинам и начинают жить как в древнем Иерусалиме..."
            },
            {
                "title": "13 сезон 4 серия: Ешь, молись, перди вагиной",
                "url": "http://online-south-park.ru/season-13/68-13-sezon-4-seriya-esh-molis-perdi-vaginoy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424349126_1.jpg",
                "description": "Ребята ждут новый выпуск шоу про Терренса и Филлипа. Но это шоу заменяется аналогичной программой, в которой главными героями являются девушки, выпускающие газ из... вагины. Казалось бы, разница не велика, но всё мужское население Саус-Парка обеспокоено новой программой."
            },
            {
                "title": "13 сезон 5 серия: Рыбные палочки",
                "url": "http://online-south-park.ru/season-13/69-13-sezon-5-seriya-rybnye-palochki.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424431137_1.jpg",
                "description": "Картман приходит к Джимми в гости в тот момент, когда последний придумывал новые шутки. Джимми удаётся придумать смешную шутку про рыбные палочки, которая становится хитом. Но Эрик считает, что шутку они придумали вместе.\nМеж тем не все поняли шутку. Рэпер Канье Уэст никак не может понять, в чем юмор, поэтому он обижается, когда его называют гей-рыбой. В итоге рэпер открывает охоту на автора шутки..."
            },
            {
                "title": "13 сезон 6 серия: Дерби соснового леса",
                "url": "http://online-south-park.ru/season-13/70-13-sezon-6-seriya-derbi-sosnovogo-lesa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424434562_1.jpg",
                "description": "Стэн конструирует машинку для участия в соревнованиях \"Дерби соснового леса\". Чтобы обеспечить победу своему сыну, Рэнди вставляет в машинку сверхпроводящий магнит и говорит, чтобы Стэн держал язык за зубами и не выдавал этот секрет. В результате машинка разгоняется и улетает в космос, где её находит инопланетянин. Пришелец требует создать вторую такую же машинку, что сделать без сверхпроводящего магнита невозможно. Поэтому Рэнди и Стэн вынуждены продолжать врать."
            },
            {
                "title": "13 сезон 7 серия: Жирная Борода",
                "url": "http://online-south-park.ru/season-13/71-13-sezon-7-seriya-zhirnaya-boroda.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424442318_1.jpg",
                "description": "Насмотревшись телевизионных программ, Картман решает стать пиратом и переехать в Сомали. Он создаёт свою команду, куда вошли Баттерс и другие и отправляется в столицу Сомали. Но в реальности данная страна оказалась намного более унылой и бедной, чем в мечтах Картмана."
            },
            {
                "title": "13 сезон 8 серия: Мёртвые знаменитости",
                "url": "http://online-south-park.ru/season-13/77-13-sezon-8-seriya-mertvye-znamenitosti.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424870283_2.jpg",
                "description": "Айку начинают мерещиться известные люди, умершие в 2009 году, среди которых был Билли Мейс. Поход к психиатру ничего не дал. Однако Картман, узнав, что Айк видит Били Мейса, понимает, что нужно срочно что-то делать, поскольку жирдяй является поклонником Мейса и считает, что его душа мучается на Земле..."
            },
            {
                "title": "13 сезон 9 серия: Козырная сучка Баттерса",
                "url": "http://online-south-park.ru/season-13/78-13-sezon-9-seriya-kozyrnaya-suchka-battersa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424957639_1.jpg",
                "description": "Ребята унижают Баттерса за то, что он ещё ни разу не целовался. К счастью для него, в школе учится девочка, которая торгует поцелуями. За 5 долларов она целует Баттерса, и тот уходит счастливый.\nВскоре Баттерсу приходит в голову идея, что он мог бы подгонять клиентов этой девочке, а прибыль они бы делили. Потом он находит новых девочек, готовых целовать мальчиков за деньги. Так Баттерс открывает \"поцелуйную\" компанию, которая перерастает в нечто более серьёзное, а Баттерс становится сутенёром."
            },
            {
                "title": "13 сезон 10 серия: W.T.F.",
                "url": "http://online-south-park.ru/season-13/79-13-sezon-10-seriya-wtf.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424959393_1.jpg",
                "description": "Под впечатлением, полученном при просмотре рестлинга, мальчики решают создать свою федерацию рестлинга. Они придумывают себе костюмы и прозвища, организуют арену на заднем дворе и начинают репетировать. Их постановочные бои начинают привлекать толпы зевак, которые начинают принимать постановочные."
            },
            {
                "title": "13 сезон 11 серия: Китовые шлюхи",
                "url": "http://online-south-park.ru/season-13/81-13-sezon-11-seriya-kitovye-shlyuhi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1425373486_1.jpg",
                "description": "В Саус-Парке группы японцев нападают на дельфинарии, убивая дельфинов и китов. Вскоре Стэн выясняет, что это происходит по всей стране. Поэтому Стэн присоединяется к команде капитана Пола Уотсона, чтобы положить этому конец..."
            },
            {
                "title": "13 сезон 12 серия: Слово на букву «П»",
                "url": "http://online-south-park.ru/season-13/84-13-sezon-12-seriya-slovo-na-bukvu-p.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1425476687_1.jpg",
                "description": "Всё чаще и чаще тишину мирного городка South Park нарушает банда байкеров. Все в округе начинают обзывать их пиндосами. Байкеры решают, что их обзывают пиндосами, поскольку они недостаточно громко издают звуки. Поэтому они начинают шуметь ещё сильнее. А жители Саус-Парка пытаются протащить поправку в английский язык, согласно которой слово \"fag\" (пиндос) должно обозначать не гея, а шумного байкера."
            },
            {
                "title": "13 сезон 13 серия: Танцы со смурфами",
                "url": "http://online-south-park.ru/season-13/85-13-sezon-13-seriya-tancy-so-smurfami.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1425478026_1.jpg",
                "description": "Картман побеждает в конкурсе школьных дикторов (в котором принимало участие 2 человека) и становится новым диктором для школьных объявлений. Жирдяй решает использовать эту возможность, чтобы издеваться над Венди, которая является президентом ученического совета. Картман придумывает историю про смурфов, которых уничтожила Венди. Тупые и доверчивые ученики, вроде Баттерса, верят каждому слову жирдяя и начинают ненавидеть Венди..."
            },
            {
                "title": "13 сезон 14 серия: Моча",
                "url": "http://online-south-park.ru/season-13/88-13-sezon-14-seriya-mocha.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-03/1425981914_1.jpg",
                "description": "Ребята идут в аквапарк. Кайл отказывается посещать аттракционы, узнав, что большинство людей ссут в воду. Остальные ребята успокаивают его, мол, \"подумаешь, несколько человек нассали в воду\". Но вскоре моча становится главной причиной катастрофы, произошедшей в аквапарке."
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 14",
        "url": "http://online-south-park.ru/season-14/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-14.jpg",
        "episodes": [
            {
                "title": "14 сезон 1 серия: Сексуальное лечение",
                "url": "http://online-south-park.ru/season-14/44-14-sezon-1-seriya-seksualnoe-lechenie.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1422962075_1.jpg",
                "description": "Ученые из института сексуальной зависимости обеспокоены тем, что богатые и успешные люди часто занимаются сексом. Ученые решают провести опыт на учениках Саус-Парка с целью выяснить, почему дети по мере взросления начинают думать о сексе. В качестве объяснения высказывается множество идей по этому поводу, но только не самое очевидное."
            },
            {
                "title": "14 сезон 2 серия: История о Жопе МакЯйцеглисте",
                "url": "http://online-south-park.ru/season-14/45-14-sezon-2-seriya-istoriya-o-zhope-makyaycegliste.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1422965022_1.jpg",
                "description": "Ученики в школе по новой программе обязаны прочитать книгу \"Над пропастью во ржи\". Мистер Гаррисон пояснил, что это очень откровенная и неоднозначная книга, в которой есть ругательства. Мальчики с удовольствием её читают, но, не найдя в ней ничего особенного, решают написать свою по-настоящему \"блевотную\" книгу под названием \"История о Жопе МакЯйцеглисте\". И им это удаётся. Но взрослые люди находят в ней тайный смысл и начинают считать её шедевром."
            },
            {
                "title": "14 сезон 3 серия: Лечебный жареный цыпленок",
                "url": "http://online-south-park.ru/season-14/47-14-sezon-3-seriya-lechebnyy-zharenyy-cyplenok.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423144762_0.jpg",
                "description": "В Саус-Парке запрещают рестораны KFC. Помещения ресторанов преобразуют в магазины по продаже лечебной марихуаны, которую можно купить, имея справку от врача. Поэтому Рэнди специально облучает свои яйца и получает рак яичек + разрешение на покупку марихуаны. А Картман вступает в банду, которая занимается продажей запрещённой продукции KFC в Южном парке."
            },
            {
                "title": "14 сезон 4 серия: У вас 0 друзей",
                "url": "http://online-south-park.ru/season-14/49-14-sezon-4-seriya-u-vas-0-druzey.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423224002_0.jpg",
                "description": "Ребята создают Стэну страницу на Facebook, хотя он был против. После этого многие люди начали навязываться к нему в друзья и обижаться, если Стэн не добавлял их или не комментировал их записи. В конце концов мальчику это надоело, и он решил удалиться из Фейсбука.\nТем временем Кайл из чувства жалости добавляется в друзья к Кипу Дрорди, у которого вообще нет друзей на Фейсбуке. После этого уважение к Кайлу в глазах его друзей начало падать."
            },
            {
                "title": "14 сезон 5 серия: 200",
                "url": "http://online-south-park.ru/season-14/52-14-sezon-5-seriya-200.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423479656_1.jpg",
                "description": "Скандальная серия \"Южного Парка\". Том Круз решает подать иск против городка за то, что Стэн назвал его упаковщиком шоколада (хотя Круз реально упаковывал шоколад на фабрике). Тома Круза поддерживают прочие знаменитости, которые уже появлялись в мультсериале в предыдущих сериях. Они говорят, что отзовут иск, если жители Саус-Парка отдадут им Мухаммеда. Стэн и Кайл вынуждены отправиться в штаб  \"Суперлучших Друзей\" и просить Мухаммеда выручить город."
            },
            {
                "title": "14 сезон 6 серия: 201",
                "url": "http://online-south-park.ru/season-14/53-14-sezon-6-seriya-201.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423487883_1.jpg",
                "description": "Серия, в которой продолжают развиваться события скандального эпизода \"200\". В конфликт подключаются рыжие дети, требующие передать Мухаммеда им, а не знаменитостям."
            },
            {
                "title": "14 сезон 7 серия: Хромое лето",
                "url": "http://online-south-park.ru/season-14/56-14-sezon-7-seriya-hromoe-leto.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423729015_1.jpg",
                "description": "В летнем лагере Джимми и Тимми принимают участие в соревнованиях детей-инвалидов. Нейтан, капитан команды соперников, вместе со своим глупым другом Мимзи будет им мешать. Данная серия является пародией на детские мультсериалы в стиле Looney Tunes. Поэтому данная серия на любителя."
            },
            {
                "title": "14 сезон 8 серия: Бедный и глупый",
                "url": "http://online-south-park.ru/season-14/57-14-sezon-8-seriya-bednyy-i-glupyy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423737824_1.jpg",
                "description": "Картман расстроен, потому что он мечтает стать гонщиком NASCAR, но его мечте не суждено сбыться. Дело в том, что жирдяй убеждён, что NASCAR - это развлечение для бедных и тупых, а он слишком богат и умён. Но с помощью Баттерса Картман решает круто изменить жизнь. Эрик прилагает максимум усилий, чтобы стать бедным и глупым, чтобы воплотить свою мечту в реальность."
            },
            {
                "title": "14 сезон 9 серия: Это фишка Джерси",
                "url": "http://online-south-park.ru/season-14/58-14-sezon-9-seriya-eto-fishka-dzhersi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423742129_1.jpg",
                "description": "Неподалеку от дома Стэна поселяется семья, приехавшая из Нью-Джерси. Родители Стэна пригласили их на ужин, чтобы познакомиться, но выяснилось, что эти люди совершенно неуравновешенны и, к тому же, странно выглядят и одеваются.\nС каждым днём в Саус-Парке становится всё больше и больше людей из Нью-Джерси. Жители, обеспокоенные этим, начали срочно искать решение, чтобы остановить потом приезжих из Нью-Джерси."
            },
            {
                "title": "14 сезон 10 серия: Новчало",
                "url": "http://online-south-park.ru/season-14/63-14-sezon-10-seriya-novchalo.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424174512_1.jpg",
                "description": "Стэн начинает страдать \"патологическим накопительством\". Он не желает выбрасывать мусор, считая, что каждая вещь ему может пригодиться в будущем. Стэна отправляют к мистеру Маки, но тот ничем помочь не может, поскольку у него та же самая проблема. Также больным патологическим накопительством признают местного пастуха просто за то, что он пасёт (читай, копит) овец. Стэна, Маки и пастуха приглашают в медицинский центр, где их погружают в сон с целью определения психологической травмы, повлекшей накопительство."
            },
            {
                "title": "14 сезон 11 серия: Очевидность (Послевидение)",
                "url": "http://online-south-park.ru/season-14/64-14-sezon-11-seriya-ochevidnost-poslevidenie.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424177254_1.jpg",
                "description": "КартманЕнот решает создать команду супергероев, в которой он был бы лидером. Так появляется команда Енота и его друзей, которая защищает город. Но никто не воспринимает их серьёзно.\nВскоре в городе появляется супергерой Капитан Очевидность. Его суперспособность заключается в том, что он способен объяснить, как людям следовало поступить в той или иной ситуации. Еноту не нравится, что Капитан Очевидность мешает работе его команды.\nТем временем по вине нефтедобывающей компания BP на Землю приходит Ктулху."
            },
            {
                "title": "14 сезон 12 серия: Восхождение Мистериона",
                "url": "http://online-south-park.ru/season-14/66-14-sezon-12-seriya-voshozhdenie-misteriona.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424269301_1.jpg",
                "description": "В данной серии продолжаются события предыдущего эпизода.\nИтак, Енот был изгнан из команды Енота и его друзей. Поэтому он отправляется в Новый Орлеан, чтобы подружиться с Ктулху и с помощью властелина тьмы отомстить своей бывшей команде.\nТем временем Мистерион (то есть, Кенни), пытаясь узнать правду о своём рождении, понимает, что в его постоянном возрождении после смерти виноваты его родители."
            },
            {
                "title": "14 сезон 13 серия: Енот против Енота и друзей",
                "url": "http://online-south-park.ru/season-14/67-14-sezon-13-seriya-enot-protiv-enota-i-druzey.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424348416_1.jpg",
                "description": "Данная серия завершает события трилогии про Енота и друзей.\nЕнот уговаривает Ктулху разобраться с командой Енота и друзей. Ктулху соглашается и отправляет ребят в Тёмное Забвение, страшный мир, наполненный странными и опасными существами. Но Мистерион придумывает план, чтобы вызволить друзей из царства тьмы..."
            },
            {
                "title": "14 сезон 14 серия: Крем-фреш",
                "url": "http://online-south-park.ru/season-14/74-14-sezon-14-seriya-krem-fresh.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1424787551_1.jpg",
                "description": "Рэнди (отец Стэна) начинает увлекаться кулинарией. Он буквально становится одержим приготовлением блюд и получает от этого сексуальное удовлетворение. Его жена не может понять, почему он предпочитает приготовление блюд сексу с ней. Но вскоре реклама подсказывает ей, что причина кроется в её плохой физической форме. Поэтому Шэрон приобретает специальный тренажёр, который похож... кхм... на мужской половой орган."
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 15",
        "url": "http://online-south-park.ru/season-15/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-15.jpg",
        "episodes": [
            {
                "title": "15 сезон 1 серия: Человекайпадоножка",
                "url": "http://online-south-park.ru/season-15/37-15-sezon-1-seriya-chelovekaypadonozhka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422541098_1.jpg",
                "description": "Устанавливая приложение, Кайл соглашается с лицензионным соглашением, в котором было прописано, что компания Apple сможет использовать его в своих опытах. После люди забирают Кайла в лабораторию Apple, где он станет частью нового устройства Apple - Человекайпадоножка.\nТем временем Картман злится на свою мать, потому что она не купила ему iPad."
            },
            {
                "title": "15 сезон 2 серия: Смехобот",
                "url": "http://online-south-park.ru/season-15/38-15-sezon-2-seriya-smehobot.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422617074_1.jpg",
                "description": "Джимми проводит конкурс, на котором происходит вручение различных наград людям за различные достижения. В номинации \"Самые несмешные люди\" победителями становятся немцы. Они сразу же высказывают своё недовольство и строят робота под названием Смехобот, который смешно шутит."
            },
            {
                "title": "15 сезон 3 серия: Королевский пудинг",
                "url": "http://online-south-park.ru/season-15/39-15-sezon-3-seriya-korolevskiy-puding.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422617517_1.jpg",
                "description": "Дошколята репетируют сценку про зубы и кариес. В этой сценке участвует Айк, который пропускает репетицию, поскольку смотрит по ТВ свадьбу канадского принца. В прямом эфире невесту похищают. Айк вместе с остальными канадцами спешит на помощь."
            },
            {
                "title": "15 сезон 4 серия: И.Р.П.",
                "url": "http://online-south-park.ru/season-15/40-15-sezon-4-seriya-irp.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422618241_1.jpg",
                "description": "Картман приходит в ярость, увидевв школе список, в котором перечислены ученики школы, а напротив написана длина. Жирдяй решает, что это администрация вывесила размеры пенисов учеников. Но ещё сильнее его раздражает то, что напротив его фамилии указано \"3 см\", что не соответствует действительности. Поэтому Картман собирает всех своих одноклассников для измерения члена..."
            },
            {
                "title": "15 сезон 5 серия: Спортивная ассоциация наркозависимых детей",
                "url": "http://online-south-park.ru/season-15/41-15-sezon-5-seriya-sportivnaya-associaciya-narkozavisimyh-detey.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422620473_1.jpg",
                "description": "Кайл смотрит очень грустную социальную рекламу про новорождённых наркозависимых детей, агитирующую стать добровольцем и помогать им. После этого он идёт в больницу, где встречает Картмана, который признаётся, что уже давно является добровольцем. Но Кайл сразу заподозрил неладное. Слежение за жирдяем приводит его в офис, где Эрик и несколько других одноклассников Кайла организовали компанию, зарабатывающую деньги на наркозависимых детях."
            },
            {
                "title": "15 сезон 6 серия: Городские суши",
                "url": "http://online-south-park.ru/season-15/43-15-sezon-6-seriya-gorodskie-sushi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1422885829_1.jpg",
                "description": "В Саус-Парке появляется японский ресторан. Баттерс, раздавая рекламные листовки, вручает одну из них Тоунг Лу Киму, владельцу китайского ресторана Гань Вань Чи. Китаец сразу же отправляется в ресторан конкурента и развязывает драку с владельцем. Лу Ким решает расправиться с владельцем японского ресторана.\nТем временем Баттерса обвиняют в разжигании драки между японцем и китайцем. Родители, желая понять, почему их сын постоянно вляпывается в подобные ситуации, отправляются с ним к психиатру, у которого у самого с головой не всё в порядке."
            },
            {
                "title": "15 сезон 7 серия: Стар ты стал",
                "url": "http://online-south-park.ru/season-15/46-15-sezon-7-seriya-star-ty-stal.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1422973061_1.jpg",
                "description": "На своё десятилетие Стэн получает диск с песнями в стиле Twin Wave. Его мать запрещает ему слушать эти песни, поскольку они не имеют смысла и отупляют. Поэтому Стэн слушает \"Твин волну\" втайне от неё. Тем не менее, мальчик приходит к выводу, что эти песни - дерьмо. Вскоре Стэн начинает понимать, что всё в его жизни - это дерьмо..."
            },
            {
                "title": "15 сезон 8 серия: Ассбургеры",
                "url": "http://online-south-park.ru/season-15/48-15-sezon-8-seriya-assburgery.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423146174_1.jpg",
                "description": "Данная серия - это прямое продолжение сюжета предыдущего эпизода. Стэн по-прежнему видит во всём дерьмо. Его родители разошлись.\nКартман же решает сымитировать синдром Аспергера. Но он слышит это как \"синдром Ассбургера\", что по-английски значит \"синдром бургеров в жопе\". Поэтому он засовывает к себе в штаны гамбургеры и идёт к школьной медсестре, которая поняла, что это прикол. Однако Кайл пробует \"жопные бургеры\" Картмана, и они ему нравятся. Эрик решает открыть свою компанию по продаже гамбургеров, но особенность их производства держит в секрете."
            },
            {
                "title": "15 сезон 9 серия: Последний из Мексикан",
                "url": "http://online-south-park.ru/season-15/50-15-sezon-9-seriya-posledniy-iz-meksikan.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423225036_1.jpg",
                "description": "Ребята играют в \"Техасцев против мексиканцев\". По правилам техасцы должны помешать мексиканцам пересечь границу. В итоге последние побеждают, но Баттерс теряется в лесу. Его находит семейная пара, которая принимает его за мексиканца, потому что он был одет соответствующе. Вскоре Баттерс по прозвищу Монтекилья стал героем Мексики."
            },
            {
                "title": "15 сезон 10 серия: Кляп в рот",
                "url": "http://online-south-park.ru/season-15/51-15-sezon-10-seriya-klyap-v-rot.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423470352_1.jpg",
                "description": "В интернете появляется новый сайт под названием \"Ябеда\", рассказывающий о позорных происшествиях некоторых учеников средней школы Южного парка. По началу большинству учеников этот сайт нравится, ведь благодаря ему можно посмеяться над \"фейлами\" неудачников. Но когда там начинают появляться подробности личной жизни каждого ученика, становится не до смеха."
            },
            {
                "title": "15 сезон 11 серия: БРАТВей",
                "url": "http://online-south-park.ru/season-15/54-15-sezon-11-seriya-bratvey.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423563422_1.jpg",
                "description": "Рэнди ведёт свою жену на бродвейский мюзикл. Чтобы отблагодарить своего мужа, она делает ему минет в машине. Но оказывается поход на мюзикл был тайным планом Рэнди, чтобы получить минет."
            },
            {
                "title": "15 сезон 12 серия: 1%",
                "url": "http://online-south-park.ru/season-15/55-15-sezon-12-seriya-1.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423571827_1.jpg",
                "description": "Из-за Картмана средний бал по физкультуре среди учеников Саус-Парка оказался ниже нормы. Поэтому в школьную программу были добавлены дополнительные уроки физкультуры. Все ученики озлоблены и желают напакостить Эрику."
            },
            {
                "title": "15 сезон 13 серия: История дня благодарения",
                "url": "http://online-south-park.ru/season-15/59-15-sezon-13-seriya-istoriya-dnya-blagodareniya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423828106_1.jpg",
                "description": "Школьникам дают задание написать сочинение про День Благодарения, индейцев и пилигримов. Стэн и прочие ребята, чтоб не заморачиваться, решают посмотреть исторический канал и написать сочинение на основании увиденного на ТВ. На историческом канале было показано, что на праздновании первого Дня Благодарения присутствовали инопланетяне. Несмотря на то, что ребята понимали, что это бред, они пересказали это всё в сочинении. На рефераты мальчиков обратило внимание руководство исторического канала, которое посчитало эти самые сочинения доказательством инопланетян на празднике."
            },
            {
                "title": "15 сезон 14 серия: Бедный ребенок",
                "url": "http://online-south-park.ru/season-15/60-15-sezon-14-seriya-bednyy-rebenok.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-02/1423829953_1.jpg",
                "description": "Родителей Кенни арестовывают, а самого Кенни вместе с братом и сестрой отдают в приёмную семью агностиков. После этого Картман становится самым бедным в школе. Жирдяй не может смириться с этим и хочет попасть, как Кенни, в более богатую семью. Поэтому он инициирует арест собственной матери, после чего попадает в ту же самую приёмную семью, в которой живёт Кенни. Но выясняется, что его новая семья ещё беднее."
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 16",
        "url": "http://online-south-park.ru/season-16/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-16.jpg",
        "episodes": [
            {
                "title": "16 сезон 1 серия: Перевёрнутая наездница",
                "url": "http://online-south-park.ru/season-16/18-16-sezon-1-seriya-perevernutaya-naezdnica.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422198570_1.jpg",
                "description": "Мать Клайда постоянно делает замечания своему сыну о том, что он забывает опустить сиденье унитаза. Она боится, что из-за этого она когда-нибудь провалится в унитаз. Самое ржачное то, что однажды так и происходит.  Мать Клайда засасывает в унитаз, и она погибает. После этого случая в городе появляется управление туалетной безопасностью, которое вводит новые правила пользования туалетом, чтобы подобное не повторилось вновь."
            },
            {
                "title": "16 сезон 2 серия: Деньги в обмен на золото",
                "url": "http://online-south-park.ru/season-16/19-16-sezon-2-seriya-dengi-v-obmen-na-zoloto.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422199886_1.jpg",
                "description": "Дедушка Марш дарит своему внукуБиллиСтэну дорогое украшение, купленное через \"магазин на диване\" за 6000 долларов. Мальчику это украшение не нужно, и он пытается сдать его в ломбард. Но там Стэну предлагают лишь 15 долларов за эту вещь. Выясняется, что телемагазины дурят стариков, продавая им безделушки за бешеные деньги. Стэн, Кайл и Кенни решают положить этому конец.\nКартман открывает свой телемагазин, где начинает наживаться на доверчивости пожилых людей."
            },
            {
                "title": "16 сезон 3 серия: Фэйсхиллинг",
                "url": "http://online-south-park.ru/season-16/20-16-sezon-3-seriya-feyshilling.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422270593_1.jpg",
                "description": "Главные герои увлекаются фотографированием себя в позе с оттягиванием одежды в районе груди. Этот дурацкий мем они называют \"фэйсхиллинг\". Но мода на этот мем очень быстро проходит. Вскоре все люди начинают считать это устаревшим мемом, что раздражает ребят. Они не собираются отказывать от фэйсхиллинга и борются за его популярность."
            },
            {
                "title": "16 сезон 4 серия: Жидокабра",
                "url": "http://online-south-park.ru/season-16/21-16-sezon-4-seriya-zhidokabra.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422275074_1.jpg",
                "description": "Приближается Пасха (Песах у евреев). Картман выдумывает Жидокабру, поедающего детей в этот праздник. Но вскоре он начинает сам верить в существование Жидокабры."
            },
            {
                "title": "16 сезон 5 серия: Яйца Баттерса",
                "url": "http://online-south-park.ru/season-16/23-16-sezon-5-seriya-yayca-battersa.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422282585_0.jpg",
                "description": "Друзья Баттерса в школе замечают у него под глазом синяк. Мальчик говорит, что фингал поставили хулиганы, но на самом деле над Баттерсом издевается... его родная бабушка. Подобно школьному хулигану, она ежедневно издевается и бьёт своего внука..."
            },
            {
                "title": "16 сезон 6 серия: Лучше бы я никогда не ездил на канатную дорогу",
                "url": "http://online-south-park.ru/season-16/26-16-sezon-6-seriya-luchshe-by-ya-nikogda-ne-ezdil-na-kanatnuyu-dorogu.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422359450_1.jpg",
                "description": "Ребята решают провести последние дни каникул, катаясь на канатной дороге. Звучит весело. Но так ли это на самом деле?"
            },
            {
                "title": "16 сезон 7 серия: Картман находит любовь",
                "url": "http://online-south-park.ru/season-16/27-16-sezon-7-seriya-kartman-nahodit-lyubov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422362151_1.jpg",
                "description": "В классе, где учатся ребята, появляется новенькая по имени Николь. Она темнокожая, поэтому Картман считает своим долгом свести её с Токеном."
            },
            {
                "title": "16 сезон 8 серия: Сарказмобол",
                "url": "http://online-south-park.ru/season-16/30-16-sezon-8-seriya-sarkazmobol.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422438606_1.jpg",
                "description": "После демонстрации по ТВ последствий спортивных травм администрация школы Саус-Парка принимает решение исключить футбол из школьной программы. Рэнди протестует против этого, говоря: \"А давайте вообще наденем на мальчиков бюстгальтеры, а мяч заменим на воздушный шар, ведь мы же не хотим, чтобы ребята получили царапины\". Разумеется, он говорит это с сарказмом, но администрация школы понимает это буквально. Так рождается новая игра - сарказмобол."
            },
            {
                "title": "16 сезон 9 серия: Поднимая планку",
                "url": "http://online-south-park.ru/season-16/31-16-sezon-9-seriya-podnimaya-planku.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422439524_0.jpg",
                "description": "Картман наконец-то признаёт, что он просто жирный. Но, вместо того, чтобы заняться собой, он приобретает специальный скутер для толстых людей. Он начинает ездить на нём повсюду, чем раздражает всех.\nОднажды Кайл видит на ТВ развлекательное шоу, в котором показывают жизнь людей с ожирением. Он понимает, что планка человечества упала столь низко, что все считают нормой те действия и явления, которые раньше вызывали стыд."
            },
            {
                "title": "16 сезон 10 серия: Внебезопасность",
                "url": "http://online-south-park.ru/season-16/32-16-sezon-10-seriya-vnebezopasnost.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422442071_1.jpg",
                "description": "Айк застаёт своих родителей, занимающихся сексом. При этом отец был одет в костюм курьера. Айк рисует картинку, на котором изображён курьер и женщина, подписанная как \"мама\". Этак картинка попадает случайно в руки отцу Стэна, который решает, что курьер трахает его жену и жён всех его друзей. Началась охота за курьером..."
            },
            {
                "title": "16 сезон 11 серия: Голос предков",
                "url": "http://online-south-park.ru/season-16/33-16-sezon-11-seriya-golos-predkov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422528430_1.jpg",
                "description": "Баттерс становится агрессивным. Его родители понимают, что \"время пришло\". Они рассказывают Баттерсу, что они приехали с Гавайских островов. А теперь Баттерсу нужно вернуться на родину, чтобы пройти ряд обрядов и обрести душевное спокойствие, воссоединившись со своим народом."
            },
            {
                "title": "16 сезон 12 серия: Кошмар на Фейстайме",
                "url": "http://online-south-park.ru/season-16/35-16-sezon-12-seriya-koshmar-na-feystayme.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422532289_1.jpg",
                "description": "Рэнди сообщает своей семье о покупке видеопроката «Блокбастер-видео» за 10000 долларов. Все члены семьи, кроме него, не верят в успех дела, ведь уже давно никто не берёт диски в прокат. Но Рэнди настаивает на своём. После нескольких дней ожидания клиентов он начинает медленно сходить с ума.\nА ребята придумывают переодеться в \"Мстителей\" на Хэллоуин и ходить по домам, выпрашивая конфеты. Но из-за того, что Рэнди не выпускает Стэна из салона видеопроката, мальчики пошли на вынужденную меру: Стэн общался с внешним миром при помощи iPad'а по видеосвязи."
            },
            {
                "title": "16 сезон 13 серия: Браслет для аплодисментов",
                "url": "http://online-south-park.ru/season-16/270-16-sezon-13-seriya-braslet-dlya-aplodismentov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-04/1460630032_1.jpg",
                "description": "Среди жителей Америки становится популярным ношение браслета с написанными на нём буквами, в которых зашифрован вопрос: \"А что на твоём месте сделал бы Иисус?\" Данный браслет служит мотиватором для людей и призывает не сдаваться, ведь Иисусу в своё время было ещё хуже. Однако всё меняется, когда учёные находят на Туринской плащанице следы наркотиков, что говорило о том, что Иисус не сильно мучился..."
            },
            {
                "title": "16 сезон 14 серия: Обама победил!",
                "url": "http://online-south-park.ru/season-16/42-16-sezon-14-seriya-obama-pobedil.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422627807_1.jpg",
                "description": "После подсчёта голосов выясняется, что Обама победил. Но Картман рассказывает Кайлу, что похитил кучу бюллетеней с голосами за другого кандидата в президенты. Зачем он это сделал? И как это связано с \"Звёздными войнами\"?"
            }
        ],
        "number_of_episodes": 14
    },
    {
        "title": "Сезон 17",
        "url": "http://online-south-park.ru/season-17/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-17.jpg",
        "episodes": [
            {
                "title": "17 сезон 1 серия: Ступай, правительство присмотрит за тобой",
                "url": "http://online-south-park.ru/season-17/10-17-sezon-1-seriya-stupay-pravitelstvo-prismotrit-za-toboy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421922416_1.jpg",
                "description": "Картман обеспокоен тем, что правительство следит за каждым человеком в городе через социальные сети. Поэтому он приобретает Говниттер - устройство, которое транслирует мысли между пользователями без компьютера. Вскоре Картман проникает в АНБ и находит свой файл, чтобы узнать, какая информация о нём известна правительству.\nТем временем Баттерс создаёт секту, где поклоняется правительству, как высшей силе."
            },
            {
                "title": "17 сезон 2 серия: Познавательная снафф-порнуха",
                "url": "http://online-south-park.ru/season-17/11-17-sezon-2-seriya-poznavatelnaya-snaff-pornuha.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421926196_1.jpg",
                "description": "Родители главных героев увлекаются просмотром порно с примесью криминала. Поэтому ребята блокируют телеканалы, показывающие подобное видео, а в качестве пароля ставят ответ на вопрос, касающийся игры Minecraft. Чтобы снять блокировку, взрослые вынуждены ознакомиться с игрой..."
            },
            {
                "title": "17 сезон 3 серия: Война миров Зиммерман",
                "url": "http://online-south-park.ru/season-17/12-17-sezon-3-seriya-voyna-mirov-zimmerman.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421928800_1.jpg",
                "description": "Картмана регулярно мучают кошмары, в которых он является главным героем фильма \"Война миров Z\". Только в его снах на его семью нападают афроамериканцы, а не зомби. Наяву Эрик считает, что Токен может стать причиной воплощения своих снов в реальность. Поэтому жирдяй всячески старается задобрить Токена, не понимая, что этим он только надоедает своему темнокожему товарищу. В итоге Токен срывается на Картмана, и жирдяй считает, что апокалипсис начался..."
            },
            {
                "title": "17 сезон 4 серия: Дети-Готы 3: Рассвет позёров",
                "url": "http://online-south-park.ru/season-17/13-17-sezon-4-seriya-deti-goty-3-rassvet-pozerov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421935104_1.jpg",
                "description": "Серия \"Южного парка\", целиком посвящённая детям-готам.\nВ городе South Park растёт число эмо. Готы обеспокоены этим, ведь они ненавидят представителей данной субкультуры.\nЧуть позже родители Генриетты отдают её в лагерь для трудных подростков. Там она превращается в эмо. Её друзья шокированы этим. Они считают, что в этом лагере детей превращают в эмо. Но как с этим бороться?"
            },
            {
                "title": "17 сезон 5 серия: Укрощение странного",
                "url": "http://online-south-park.ru/season-17/15-17-sezon-5-seriya-ukroschenie-strannogo.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422008962_0.jpg",
                "description": "У Айка внезапно начинается переходный возраст. Он покрывается прыщами, становится агрессивным и помешанным на сексе. Кайл не может понять, почему у его брата половое созревание началось в столь юном возрасте.\nА мистер Маки покупает для школы Интеллилинк - новую систему управления различными элементами. Так, с помощью данной системы можно записаться на приём к медсестре или выключить свет в кабинете, используя монитор в стене. Но Интеллилинк работает не так, как нужно."
            },
            {
                "title": "17 сезон 6 серия: Рыжая корова",
                "url": "http://online-south-park.ru/season-17/16-17-sezon-6-seriya-ryzhaya-korova.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422009927_1.jpg",
                "description": "Картман одевает корове рыжий парик и рисует огромные веснушки. После этого рассказывает всем в классе, что видел рыжую корову. Несмотря на то, что для Кайла становится очевидно, что это розыгрыш, все остальные люди верят, что перед ними рыжая корова.\nВскоре выясняется, что рыжая корова является для всех конфессий знамением мира. Все религии объединяются в одну. На Земле воцаряется мир. После этого Картман сообщает Кайлу, что хочет рассказать всем о розыгрыше..."
            },
            {
                "title": "17 сезон 7 серия: Чёрная пятница",
                "url": "http://online-south-park.ru/season-17/24-17-sezon-7-seriya-chernaya-pyatnica.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422356260_1.jpg",
                "description": "Ребята готовятся к Чёрной пятнице. Это день, когда в гипермаркете Саус парка ожидаются огромные скидки. Мальчики хотят получить приставку нового поколения с огромной скидкой. Но это будет сделать сложно, ведь не только они желают покупать товары со скидкой."
            },
            {
                "title": "17 сезон 8 серия: Песнь зада и пламени",
                "url": "http://online-south-park.ru/season-17/28-17-sezon-8-seriya-pesn-zada-i-plameni.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422434559_1.jpg",
                "description": "Вторая часть трилогии про чёрную пятницу. Принцесса Кенни переходит на сторону команды PS4. В результате боевой дух команды усилился, а их численность стала больше.\nВскоре о конфликте ребят узнают глава Sony и Microsoft. Они решают воспользоваться этим в качестве маркетингового хода. Билл Гейтс желает, чтобы победила команда ребят Xbox One, а глава Sony пытается создать условия для победы команды PS4."
            },
            {
                "title": "17 сезон 9 серия: Сиськи и Драконы",
                "url": "http://online-south-park.ru/season-17/29-17-sezon-9-seriya-siski-i-drakony.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422435481_1.jpg",
                "description": "Завершающая третья часть трилогии про чёрную пятницу. Число любителей PS4 растёт. Близится конец войны. Ключ к победе - ресторан \"Красная птичка\"."
            },
            {
                "title": "17 сезон 10 серия: Хоббит",
                "url": "http://online-south-park.ru/season-17/36-17-sezon-10-seriya-hobbit.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422533730_1.jpg",
                "description": "Последняя серия 17 сезона \"Южного парка\". Канье Уэст, известный по эпизоду \"Рыбные палочки\" злится, что Ким Кардашьян, с которой он встречается, все называют хоббитом. Он стремится доказать, что она не хоббит, однако в ходе доказательства получается обратное."
            }
        ],
        "number_of_episodes": 10
    },
    {
        "title": "Сезон 18",
        "url": "http://online-south-park.ru/season-18/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-18.jpg",
        "episodes": [
            {
                "title": "18 сезон 1 серия: Себе пофинансируй",
                "url": "http://online-south-park.ru/season-18/5-18-sezon-1-seriya-sebe-pofinansiruy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421826093_1.jpg",
                "description": "Поскольку стартапы сейчас являются модным явлением, то мальчики решили организовать собственный стартап, используя сервис Kickstarter. При этом у них нет никаких идей и даже нормального названия. К счастью, им удаётся получить возможность использовать название и символику Washington Redskins. Это приводит к успеху, но руководство Washington Redskins не собирается оставить это просто так."
            },
            {
                "title": "18 сезон 2 серия: Безглютеновая Эбола",
                "url": "http://online-south-park.ru/season-18/6-18-sezon-2-seriya-bezglyutenovaya-ebola.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421831494_1.jpg",
                "description": "После неудачного опыта со стартапом ребята возвращаются в школу. Но все ученики отказываются с ними дружить. Поэтому, чтобы загладить свою вину, мальчики решают устроить вечеринку, на которой будет пицца и певица Лорд.\nТем временем мистер Маки исключает из своего рациона продукты, содержащие глютен. Он начинает пропагандировать безглютеновую диету. Вскоре начинают происходить странные вещи: у людей, употреблявших глютен, отваливается член, и они умирают."
            },
            {
                "title": "18 сезон 3 серия: Неженка",
                "url": "http://online-south-park.ru/season-18/7-18-sezon-3-seriya-nezhenka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421838970_1.jpg",
                "description": "Картман в ярости из-за того, что мужской туалет в школе постоянно занят. Он решает притвориться трансгендером, чтобы ходить в женский туалет. Директор школы ничего не может с этим поделать, ведь это будет выглядеть, как ущемление прав трансгендеров. Но и позволить Эрику ходить в туалет для девочек тоже нельзя. Поэтому в школе был создан туалет для трансгендеров, который стал персональным для Картмана."
            },
            {
                "title": "18 сезон 4 серия: Таксинвалидка (Автовалидка)",
                "url": "http://online-south-park.ru/season-18/8-18-sezon-4-seriya-taksinvalidka-avtovalidka.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421842486_1.jpg",
                "description": "Тимми придумывает новый вид услуг - Handicar (\"Таксинвалидка\" или \"Автовалидка\"). Это обычное такси, где Тимми исполняет роль водителя, сидя в инвалидном кресле, а пассажиры находятся в прицепе. Услуга пользуется спросом. Тимми легко собирает большую сумму денег для пожертвования в лагерь детей-инвалидов. Это не нравится Нейтану и Мимзи. Они начинают строить козни Тимми."
            },
            {
                "title": "18 сезон 5 серия: Волшебный куст",
                "url": "http://online-south-park.ru/season-18/9-18-sezon-5-seriya-volshebnyy-kust.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421849862_2.jpg",
                "description": "Баттерс случайно проговаривается Картману о том, что у его отца в гараже имеется дрон-квадрокоптер. Несмотря на то, что Баттерсу запрещено приближаться к дрону, они берут пульт управления дроном. Картман, управляя квадрокоптером, заглядывает в окно дома Крэйга и снимает на видео его обнажённую мать. В объектив камеры дрона попадает заросшая генитальная область женщины. Позже видео попадает на YouTube, что вызывает скандал."
            },
            {
                "title": "18 сезон 6 серия: Условно-бесплатное — не бесплатно",
                "url": "http://online-south-park.ru/season-18/14-18-sezon-6-seriya-uslovno-besplatnoe-ne-besplatno.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1421936827_1.jpg",
                "description": "Джимми советует ученикам новую игру про Терренса и Филлипа. Ребята пробуют поиграть в неё, но вскоре начинают считать её полным дерьмом. Несмотря на это, Стэн продолжает в неё играть и тратит 489 долларов на различные игровые возможности. Он не может остановиться, поэтому друзья пытаются помочь ему."
            },
            {
                "title": "18 сезон 7 серия: Заточение в виртуальности",
                "url": "http://online-south-park.ru/season-18/17-18-sezon-7-seriya-zatochenie-v-virtualnosti.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422011896_1.jpg",
                "description": "Картман разыгрывает Баттерса, одевая на него наушники и пластиковые очки и убеждая, что тот находится в виртуальной реальности. Баттерс верит этому, но вскоре ситуация выходит из под контроля: решив, что в виртуальной реальности всё возможно, мальчик начинает творить бесчинства и попадает в больницу. Картман идёт в больницу к Баттерсу и говорит, что последний застрял в виртуальной реальности. Но ещё предстоит выяснить, кто там действительно застрял."
            },
            {
                "title": "18 сезон 8 серия: Петушиная магия",
                "url": "http://online-south-park.ru/season-18/22-18-sezon-8-seriya-petushinaya-magiya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422281741_1.jpg",
                "description": "Ребята отправляются на турнир по игре Magic: The Gathering, в котором примет участи Кенни. После турнира они долго обсуждают увиденную зрелищную игру. Подслушавший их уборщик рекомендует сходить на настоящее зрелище - Cock Magic (Петушиная магия). По сути это то же самое, только в карты играют петухи. Ребятам понравилось зрелище, и они делятся эмоциями у Стэна дома. Отец Стэна, случайно подслушавший их, всё неправильно понимает, ведь слово \"cock\" переводится с английского языка не только как \"петух\", но и как \"половой член\"."
            },
            {
                "title": "18 сезон 9 серия: #REHASH",
                "url": "http://online-south-park.ru/season-18/25-18-sezon-9-seriya-rehash.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422358046_1.jpg",
                "description": "Кайл обеспокоен тем, что современное поколение геймеров предпочитает не играть в компьютерные игры, а смотреть записи их прохождений с комментариями на YouTube. Картман, узнав это, решает завести свой канал, где тупо комментирует свою жизнь.\nТем временем певица Лорд возвращается."
            },
            {
                "title": "18 сезон 10 серия: #СчастливыхГолограмм",
                "url": "http://online-south-park.ru/season-18/34-18-sezon-10-seriya-schastlivyhgologramm.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-01/1422530539_1.jpg",
                "description": "В данной серии продолжают развиваться события, начатые впредыдущей серии. Чтобы люди вновь вместе начали проводить время перед экранами ТВ, Кайл начинает публиковать материалы в социальных сетях с хэш-тегом #СпаситеГостиные. Вскоре к нему приходит Билл Косби и предлагает сотрудничество по продвижению рождественского телешоу при помощи хэш-тега Кайла. Но Билл Косби не настоящий. С Кайлом разговаривала голограмма."
            }
        ],
        "number_of_episodes": 10
    },
    {
        "title": "Сезон 19",
        "url": "http://online-south-park.ru/season-19/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-19.jpg",
        "episodes": [
            {
                "title": "19 сезон 1 серия: Отважная и прекрасная",
                "url": "http://online-south-park.ru/season-19/259-19-sezon-1-seriya-otvazhnaya-i-prekrasnaya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-09/1443184425_1.jpg",
                "description": "Директрису Викторию увольняют. На её место ставят нового директора, который помешан на политкорректности и толерантности. Он наказывает всех, кто по его мнению был неполиткорректным. Поэтому у многих учеников начинаются проблемы в школе. Под раздачу попадают Картман и даже Кайл."
            },
            {
                "title": "19 сезон 2 серия: Куда же катится моя страна?",
                "url": "http://online-south-park.ru/season-19/261-19-sezon-2-seriya-kuda-zhe-katitsya-moya-strana.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-10/1444039143_1.jpg",
                "description": "После того, в Южном парке стала пропагандироваться толерантность и политкорректность, США наводнили беженцы из Канады. Саус-Парк буквально был усыпан беженцами и городу пришлось подстраиваться под них. Мистер Гаррисон не захотел быть терпилой и выступил против, за что был уволен политкорректным директором..."
            },
            {
                "title": "19 сезон 3 серия: Городская часть города",
                "url": "http://online-south-park.ru/season-19/262-19-sezon-3-seriya-gorodskaya-chast-goroda.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-10/1444734205_1.jpg",
                "description": "Из-за событий, произошедших в прошлой серии по вине мистера Гаррисона, South Park становится объектом насмешек на ТВ. На город ложится клеймо нетолерантного места. Поэтому в администрации Южного парка принимается решение по обновлению и облагораживанию. Прямо около дома Кенни строится район \"Содосопа\", в котором отдыхают люди."
            },
            {
                "title": "19 сезон 4 серия: Ты не Йелпишь",
                "url": "http://online-south-park.ru/season-19/263-19-sezon-4-seriya-ty-ne-yelpish.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-11/1446466005_1.jpg",
                "description": "В Южном парке многие жители становятся \"йелперами\". Так называют ресторанных критиков, высказывающих своё мнение о заведениях через специальное приложение. Картман просто не мог не стать йелпером, ведь это отличная возможность для шантажа владельцев заведений..."
            },
            {
                "title": "19 сезон 5 серия: Безопасное пространство",
                "url": "http://online-south-park.ru/season-19/264-19-sezon-5-seriya-bezopasnoe-prostranstvo.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-11/1446466555_1.jpg",
                "description": "Картман жалуется ПК-директору, что его фотографии в соцсети набирают негативные комментарии. Директор назначает Баттерса редактором странички жирдяя. Отныне Баттерс обязан просматривать комментарии под фотографиями Эрика и удалять те, в которых жирдяя высмеивают. Баттерс вынужден согласиться, ведь в противном случае его накажут.\nТем временем кассир в магазине \"Фермер фермер\" постоянно ставит Рэнди в неловкое положение, предлагая пожертвовать 1 доллар голодающим детям."
            },
            {
                "title": "19 сезон 6 серия: Твик + Крэйг",
                "url": "http://online-south-park.ru/season-19/265-19-sezon-6-seriya-tvik-kreyg.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-11/1447185396_1.jpg",
                "description": "Ученицы-азиатки из школы Южного парка рисуют несколько картин с Твиком и Крэйгом в стиле \"яой\". После этого все близкие им люди начинают их считать геями. Это чертовски злит как Твика, так и Крэйга, но они не могут признаться в своей гетеросексуальности из-за ПК-директора."
            },
            {
                "title": "19 сезон 7 серия: Шаловливые ниндзя",
                "url": "http://online-south-park.ru/season-19/266-19-sezon-7-seriya-shalovlivye-nindzya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-11/1448138887_1.jpg",
                "description": "Ребята решают стать ниндзя. Они переодеваются в форму ниндзя, которая, к слову сказать, очень похожа на одежду террористов из ИГИЛ.\nТем временем ПК-директор вызывает полицию в школу из-за одной ученицы. Барбредди случайно ранит одного из учеников. После этого случая жители Южного парка решают отказаться от полиции совсем."
            },
            {
                "title": "19 сезон 8 серия: Спонсорский контент",
                "url": "http://online-south-park.ru/season-19/267-19-sezon-8-seriya-sponsorskiy-kontent.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-12/1449935914_1.jpg",
                "description": "Первая часть трилогии \"Южного парка\" про рекламу.\nПК-директор снова в ярости. На этот раз из-за того, что в школьную газету просочилось слово \"дебильный\". Директор готов переломать ноги редактору. Однако всё меняется, когда он узнаёт, что за газету отвечает калека Джимми. ПК-директору не удаётся убедить инвалида в важности цензуры. Джимми продолжает раздавать номера своей газеты, но отныне вне стен школы..."
            },
            {
                "title": "19 сезон 9 серия: Правда и реклама",
                "url": "http://online-south-park.ru/season-19/268-19-sezon-9-seriya-pravda-i-reklama.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2015-12/1449937225_1.jpg",
                "description": "Вторая часть трилогии \"Южного парка\" про рекламу.\nДжимми продолжает находиться в каком-то секретном месте журналистов. Там он общается с Лесли и пытается понять, кем она является. Несмотря на то, что журналисты утверждают, что Лесли является ходячей рекламой и опасна для города, инвалид её спасает.\nА тем временем мистер Гаррисон, директриса Виктория и Кейтлин Дженер едут в Саус-Парк. Они в шоке от того, во что превратился город."
            },
            {
                "title": "19 сезон 10 серия: Последнее правосудие П.К. Директора",
                "url": "http://online-south-park.ru/season-19/269-19-sezon-10-seriya-poslednee-pravosudie-pk-direktora.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-01/1452279954_1.jpg",
                "description": "Третья часть трилогии \"Южного парка\" про рекламу.\nП.К. Директор начинает войну против рекламы. В это время в Саус-Парке все жители начинают приобретать пистолеты. С оружием в руках человек выглядит убедительнее. Поэтому Стэн использует пушку, чтобы узнать всю правду о деятельности отца, а Кайл собирается надавить на Стэна..."
            }
        ],
        "number_of_episodes": 10
    },
    {
        "title": "Сезон 20",
        "url": "http://online-south-park.ru/season-20/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-20.jpg",
        "episodes": [
            {
                "title": "20 сезон 1 серия: Членские ягоды (Вспоминика)",
                "url": "http://online-south-park.ru/season-20/275-20-sezon-1-seriya-chlenskie-yagody-vspominika.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-09/1474456352_1.jpg",
                "description": "Девочки-игроки волейбольной команды решают сидеть во время исполнения гимна перед началом игры. Они делают это в знак протеста против троллинга некоего пользователя, скрывающегося под ником skankhunt42 (\"шмаралов42\" в переводе Кубиков). Правительство же считает, что гимн уже не вызывает чувств патриотизма у американцев и его нужно переписать. Рэнди возмущён, что на выборах большинство людей будут поддерживать гигантскую клизму, коим является мистер Гаррисон. Ему рекомендуют есть ягоду Вспоминику, которая успокаивает нервы."
            },
            {
                "title": "20 сезон 2 серия: Охотник на шалав (Шмаролов)",
                "url": "http://online-south-park.ru/season-20/276-20-sezon-2-seriya-ohotnik-na-shalav-shmarolov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-09/1475005299_0.jpg",
                "description": "Джеральд Брофловски продолжает троллить женщин в социальных сетях. Никто даже не догадывается, что пользователем под ником skankhunt42 (шмаролов42) является отец Кайла. Меж тем ребята подозревают во всём Картмана. Они решают положить конец троллю и разобраться с Эриком."
            },
            {
                "title": "20 сезон 3 серия: Проклятый",
                "url": "http://online-south-park.ru/season-20/277-20-sezon-3-seriya-proklyatyy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-10/1475356369_1.jpg",
                "description": "Отец Кайла продолжает наслаждаться плодами своего троллинга. Его альтер-эго \"шмаролов42\" обсуждают на шоу. Но вскоре в его дом стучатся полицейские...\nКартман, оставшись без гаджетов, вынужден вести жизнь изгоя. Он начинает общаться с Хайди, которая недавно объявила о своём уходе из Твиттера."
            },
            {
                "title": "20 сезон 4 серия: Сардельки наружу",
                "url": "http://online-south-park.ru/season-20/278-20-sezon-4-seriya-sardelki-naruzhu.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-10/1476821272_1.jpg",
                "description": "Баттерс поднимает бунт среди мальчиков. Они собираются отстаивать мальчишечьи права странным образом.\nТем временем Джеральд приходит под мост, чтобы встретиться с человеком, от которого он получил записку в предыдущей серии."
            },
            {
                "title": "20 сезон 5 серия: Клизма и датчане",
                "url": "http://online-south-park.ru/season-20/279-20-sezon-5-seriya-klizma-i-datchane.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-10/1477600313_1.jpg",
                "description": "Мистер Гаррисона наконец-то придумывает способ проиграть на выборах. Дания начинает активно пиарить свой сервис по вычислению троллей. Картман и Хайди объединяют мальчиков и девочек и организуют команду по сбору средств в пользу анти-тролльного сервиса, придуманного датчанами."
            },
            {
                "title": "20 сезон 6 серия: Форт-Коллинс",
                "url": "http://online-south-park.ru/season-20/280-20-sezon-6-seriya-fort-kollins.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-11/1478077600_1.jpg",
                "description": "Страсти продолжают накаляться. Хайди придумывает способ вычислить Шмаролова. Рэнди и мистер Гаррисон ищут метод уничтожения ягод Вспоминики. А датчанам удаётся взломать данные переписки жителей города Форт-Коллинс."
            },
            {
                "title": "20 сезон 7 серия: О Боже!",
                "url": "http://online-south-park.ru/season-20/281-20-sezon-7-seriya-o-bozhe.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-11/1479502014_1.jpg",
                "description": "Городок Южный парк (впрочем, как и вся страна) пребывает в шоке от результатов выборов. В Форт-Коллинсе продолжаются волнения на почве недавнего взлома всей интернет-информации жителей города. А в дом Брофловски прибывают агенты ФБР и забирают Джеральда."
            },
            {
                "title": "20 сезон 8 серия: Только для членов",
                "url": "http://online-south-park.ru/season-20/282-20-sezon-8-seriya-tolko-dlya-chlenov.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-12/1480972433_1.jpg",
                "description": "Гаррисон наконец-то становится президентом. Почувствовав власть, он начинает мстить своим давним обидчикам.\nТем временем Картман планирует улететь с Хайди на Марс. Ягоды вспоминики, собравшись огромной кучей, отправились в белый дом, а Джеральд продолжает оставаться в плену у датчан."
            },
            {
                "title": "20 сезон 9 серия: Не смешно",
                "url": "http://online-south-park.ru/season-20/283-20-sezon-9-seriya-ne-smeshno.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-12/1481468870_1.jpg",
                "description": "Кайл узнаёт, что это его отец был тем самым троллем, который поставил на уши всю Америку. Джеральд же до последнего пытается оправдаться, но это у него не очень хорошо получается. Хайди размышляет над проблемой отправки людей на Марс, а Картман верит в неё, ведь она смешная. Мистер Мазохист уговаривает Гаррисона бомбить Данию."
            },
            {
                "title": "20 сезон 10 серия: Конец сериализации в том виде, в котором мы её знаем",
                "url": "http://online-south-park.ru/season-20/284-20-sezon-10-seriya-konec-serializacii-v-tom-vide-v-kotorom-my-ee-znaem.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2016-12/1482008921_0.jpg",
                "description": "Заключительная серия 20 сезона, в которой поставится точка во всех сюжетных линиях: судьбе Джеральда и троллей, мечтах Картмана о полёте на Марс, конфликте с Данией и сервисе Trolltrace."
            }
        ],
        "number_of_episodes": 10
    },
    {
        "title": "Сезон 21",
        "url": "http://online-south-park.ru/season-21/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-21.jpg",
        "episodes": [
            {
                "title": "21 сезон 1 серия: Белые люди реконструируют дома",
                "url": "http://online-south-park.ru/season-21/301-21-sezon-1-seriya-belye-lyudi-rekonstruiruyut-doma.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-09/1505825804_1.jpg",
                "description": "Итак, 1 серия 21 сезона. Сезон стартовал.\nБыдло-реднеки (это такой американский аналог русской деревенщины) устраивают протест по поводу того, что очередные гады лишили их работы. Тем временем отношения Картмана и Хайди пребывают в кризисе."
            },
            {
                "title": "21 сезон 2 серия: Убери",
                "url": "http://online-south-park.ru/season-21/302-21-sezon-2-seriya-uberi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-09/1506538425_1.jpg",
                "description": "Похоже, что Картман возобновил свои отношения с Хайди. Вот только зачем ему это, если в предыдущей серии он дал ясно понять, что эти отношения ему не нужны?\nТем временем Твик обеспокоен угрозой со стороны Северной Кореи."
            },
            {
                "title": "21 сезон 3 серия: Праздничный выпуск",
                "url": "http://online-south-park.ru/season-21/304-21-sezon-3-seriya-prazdnichnyy-vypusk.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-10/1507402672_1.jpg",
                "description": "Рэнди (отец Стэна) начинает борьбу против Колумба: он стремится уничтожить все памятники Колумбу и вызвать ненависть к этой исторической личности у всех жителей Америки."
            },
            {
                "title": "21 сезон 4 серия: Приквел франшизы",
                "url": "http://online-south-park.ru/season-21/305-21-sezon-4-seriya-prikvel-franshizy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-10/1508668001_1.jpg",
                "description": "Долгожданное возвращение Енота и его друзей, которых мы не видели стрилогии про них. На этот раз ребята хотят снять сериал для Netflix, но кто-то начинает распускать о них дезинформацию."
            },
            {
                "title": "21 сезон 5 серия: Гуммели и героин",
                "url": "http://online-south-park.ru/season-21/308-21-sezon-5-seriya-gummeli-i-geroin.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-10/1509366112_1.jpg",
                "description": "В Южном парке начинают умирать от передозировки наркотиками молодые люди, в основном аниматоры на детских праздниках. Очевидно, источником распространения наркотиков является местный дом престарелых. А Стэн, сам того не ведая, становится распространителем."
            },
            {
                "title": "21 сезон 6 серия: Сыновья ведьм",
                "url": "http://online-south-park.ru/season-21/311-21-sezon-6-seriya-synovya-vedm.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-11/1509990871_1.jpg",
                "description": "Серия \"Южного парка\", приуроченная к Хэллоуину.\nОказывается, у Рэнди и его друзей на Хэллоуин есть традиция: закупаться алкоголем, переодеваться в ведьм, выезжать за город и устраивать там \"бухич\". Но, кажется, в этом году что-то пошло не так..."
            },
            {
                "title": "21 сезон 7 серия: Двойная игра",
                "url": "http://online-south-park.ru/season-21/312-21-sezon-7-seriya-dvoynaya-igra.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-11/1510929698_1.jpg",
                "description": "И вновь Картман рыдает из-за кризиса отношений с Хайди. И вновь она его прощает. И вновь он издевается над ней. Кайлу становится любопытно, почему она позволяет Картману так относиться к ней..."
            },
            {
                "title": "21 сезон 8 серия: Тихоходки (Морские медведи)",
                "url": "http://online-south-park.ru/season-21/314-21-sezon-8-seriya-tihohodki-morskie-medvedi.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-11/1511553710_1.jpg",
                "description": "В Саус-Парке организуют научную ярмарку среди детей-инвалидов. Натан и Мимзи собираются стать победителями. Но вот же незадача: эксперимент, проводимый Джимми и Тимми, гораздо круче и, похоже, именно они победят. Натан не хочет этого допустить."
            },
            {
                "title": "21 сезон 9 серия: Супер тяжелая политкорректность",
                "url": "http://online-south-park.ru/season-21/328-21-sezon-9-seriya-super-tyazhelaya-politkorrektnost.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-12/1513241498_1.jpg",
                "description": "Поскольку в школе Саус-Парка участились случаи травли учеников, то ПК-директор был вынужден нанять нового заместителя директора. Им становится Сильная Женщина, которая помешана на политкорректности и правах слабых и меньшинств ещё сильнее, чем ПК-директор. А тем временем на Netflix показывают новый сериал про Терренса и Филлипа."
            },
            {
                "title": "21 сезон 10 серия: Тухлые томаты",
                "url": "http://online-south-park.ru/season-21/329-21-sezon-10-seriya-tuhlye-tomaty.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2017-12/1513256306_0.jpg",
                "description": "Дети (впрочем, как и некоторые взрослые) начинают видеть президента на улицах своего города. Жители Южного парка напуганы этим, поэтому решают предпринимать необходимые меры, чтобы избавиться от президента. Тем временем Айк, узнавший о сбросе бомбы на Канаду, решает мстить."
            }
        ],
        "number_of_episodes": 10
    },
    {
        "title": "Сезон 22",
        "url": "http://online-south-park.ru/season-22/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-22.jpg",
        "episodes": [
            {
                "title": "22 сезон 1 серия: Мёртвые дети",
                "url": "http://online-south-park.ru/season-22/357-22-sezon-1-seriya-mertvye-deti.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-10/1538587528_1.jpg",
                "description": "В школе Южного парка начинают происходить перестрелки, в которых погибают ученики. Казалось бы, про это говорят так часто, что это уже стало обыденностью для жителей города. Но только не для матери Стэна.\nА тем временем Картман заваливает тест, поскольку списывал его у Токена, а Токен сам допустил ряд ошибок. Эрик решает разобраться, в чём была причина провала."
            },
            {
                "title": "22 сезон 2 серия: Мальчики пропали без вести",
                "url": "http://online-south-park.ru/season-22/358-22-sezon-2-seriya-malchiki-propali-bez-vesti.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-10/1539682726_1.jpg",
                "description": "Горячая серия на щепетильную тему в лучших старых традициях \"Южного парка\". Поскольку в мире уже никого не удивишь случаями сексуальных контактов церковнослужителей с мальчиками, то приходской священник церкви Южного парка становится объектом насмешек и пародий. Баттерсу становится жалко священника, и он решает подружиться с ним."
            },
            {
                "title": "22 сезон 3 серия: Проблема с какашкой",
                "url": "http://online-south-park.ru/season-22/359-22-sezon-3-seriya-problema-s-kakashkoy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-10/1540118432_1.jpg",
                "description": "Городской совет Южного Парка решает урезать бюджет на рождественское представление. Под удар попадает мистер Хэнки, рождественская какашка, от услуг которого планируется отказаться.\nА тем временем между ПК-директором и Сильной Женщиной возникает конфликт."
            },
            {
                "title": "22 сезон 4 серия: Фермы стоинства",
                "url": "http://online-south-park.ru/season-22/360-22-sezon-4-seriya-fermy-stoinstva.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-10/1540553090_1.jpg",
                "description": "Рэнди, неудовлетворенный городской жизнью, решает уехать жить на свою ферму, где начинает выращивать коноплю. А тем временем в школе Южного Парка набирает популярность вейперство."
            },
            {
                "title": "22 сезон 5 серия: Самокаты",
                "url": "http://online-south-park.ru/season-22/361-22-sezon-5-seriya-samokaty.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-11/1542017196_1.jpg",
                "description": "Южный Парк наводняют самокаты, которые сейчас являются новым трендом. Все жители рады, но мистера Маки это всерьёз настораживает. Откуда они?\nА тем временем Кайлу приходит в голову идея использовать самокаты во время колядования на Хэллоуин, чтобы собрать конфет больше всех."
            },
            {
                "title": "22 сезон 6 серия: Настало время сурьёзности",
                "url": "http://online-south-park.ru/season-22/362-22-sezon-6-seriya-nastalo-vremya-sureznosti.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-11/1542444974_1.jpg",
                "description": "Для просмотра этой серии необходимо быть максимально супер сурьёзным. Дело в том, что в Южном парке объявился Челмедведосвин. Пока он терроризирует жителей, мальчики вспоминают, что когда-то про Челмедведосвина им рассказывал Эл Гор. Его тогда приняли за сумасшедшего. Сейчас же только он может помочь городу."
            },
            {
                "title": "22 сезон 7 серия: Никто так и не стал сурьёзным?",
                "url": "http://online-south-park.ru/season-22/363-22-sezon-7-seriya-nikto-tak-i-ne-stal-sureznym.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-11/1543260062_1.jpg",
                "description": "Прямое продолжение предыдущей серии. Мальчики оказываются в тюрьме, а Челмедведосвин продолжает бесчинствовать. Казалось бы, ситуацию может исправить Эл Гор, но он обижен на всех из-за их несурьёзности."
            },
            {
                "title": "22 сезон 8 серия: Коробка Будды",
                "url": "http://online-south-park.ru/season-22/364-22-sezon-8-seriya-korobka-buddy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-12/1544108065_1.jpg",
                "description": "Картману надоедает, что все вокруг пытаются его отвлечь в момент, когда он развлекается в смартфоне. Поэтому Эрик решает заказать так называемую коробку Будды, чтобы избавить себя от окружающих."
            },
            {
                "title": "22 сезон 9 серия: Невыполненный",
                "url": "http://online-south-park.ru/season-22/365-22-sezon-9-seriya-nevypolnennyy.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-12/1544617074_1.jpg",
                "description": "Ребята решают поучаствовать в велопараде и победить. Для этого нужно создать уникальный велосипед своими руками. Проблемы появляются тогда, когда работники Amazon решают устроить забастовку из-за нечеловеческого обращения с ними."
            },
            {
                "title": "22 сезон 10 серия: Велопарад",
                "url": "http://online-south-park.ru/season-22/366-22-sezon-10-seriya-veloparad.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2018-12/1545502999_1.jpg",
                "description": "Ну, вот и очередной сезон подошёл к концу. Последняя серия 22 сезона. Пускаем слезу и ждём следующего сезона.\nСюжет продолжает события предыдущей серии. Мальчики готовятся к велопараду. Тем временем на Амазон трудятся новые работники, которые ранее работали в торговом центре и очень одичали."
            }
        ],
        "number_of_episodes": 10
    },
    {
        "title": "Сезон 23",
        "url": "http://online-south-park.ru/season-23/",
        "cover_url": "http://online-south-park.ru/uploads/seasons_imgs/sp-23.jpg",
        "episodes": [
            {
                "title": "23 сезон 1 серия: Мексиканский Джокер",
                "url": "http://online-south-park.ru/season-23/367-23-sezon-1-seriya-meksikanskiy-dzhoker.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-10/1569942483_1.jpg",
                "description": "Первая серия 23 сезона. Поехали.\nРэнди продолжает колотить бабло на своей ферме стоинства. Но в определённый момент он замечает, что его дела начинают идти хуже. А тем временем Картман делает донос, и всю семью Брофловски задерживают, как нелегальных мигрантов."
            },
            {
                "title": "23 сезон 2 серия: Группа из Китая",
                "url": "http://online-south-park.ru/season-23/368-23-sezon-2-seriya-gruppa-iz-kitaya.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-10/1570528939_1.jpg",
                "description": "Рэнди планирует расширить свой бизнес посредством поставок травы Стоинства в Китай. Вот только он не учёл факт того, что в Китае любые наркотики под запретом.\nА тем временем мальчики основывают дэд-метал-группу и исполняют песни, написанные Стэном, в которых он выражает свою ненависть к ферме. На них обращает внимание один продюсер."
            },
            {
                "title": "23 сезон 3 серия: Прививки!!!",
                "url": "http://online-south-park.ru/season-23/369-23-sezon-3-seriya-privivki.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-10/1571330282_1.jpg",
                "description": "В соответствии с законом все дети, посещающие школу Южного Парка, обязаны быть привиты. Разумеется, это касается и Эрика Картмана. Однако он наотрез отказывается прививаться, и его отказ становится настоящей проблемой чуть ли не для всего города.\nА тем временем Рэнди Марш празднует достижение. Ему удалось заработать уже 300 тысяч долларов на продаже травы."
            },
            {
                "title": "23 сезон 4 серия: Пусть они едят гущу",
                "url": "http://online-south-park.ru/season-23/370-23-sezon-4-serija-pust-oni-edjat-guschu.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-10/1571665526_1.jpg",
                "description": "Пытаясь залатать дыры в финансах, Рэнди начинает реализовывать не только листья травы, но также и малополезные стебли. Он начинает производить бургеры Стоинства, в состав которых идут отходы от реализации травы. И это приходится очень кстати, ведь население Южного парка с каждым днём всё больше и больше начинает отдавать предпочтение веганской пище. Вот только есть одно но: у Рэнди имеется могущественный конкурент."
            },
            {
                "title": "23 сезон 5 серия: Хэллоуин на ферме стоинства",
                "url": "http://online-south-park.ru/season-23/372-23-sezon-5-serija-hjellouin-na-ferme-stoinstva.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-11/1573282969_1.jpg",
                "description": "Рэнди готовится к празднованию Хэллоуина, а заодно вместе с Полотенчиком подготавливает специальную травку, приуроченную к данному празднику. А тем временем Баттерс с родителями идёт в музей египетской истории, где на него было наложено проклятие."
            },
            {
                "title": "23 сезон 6 серия: Финал сезона",
                "url": "http://online-south-park.ru/season-23/373-23-sezon-6-serija-final-sezona.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-11/1573981334_1.jpg",
                "description": "Рэнди попадает в тюрьму, поскольку против него нашлись доказательства того, что это он устраивал взрывы во дворах жителей города. А тем временем под колёсами полицейской машины погибает Джейсон Белый (Jason White), и его родители начинают свою кампанию против угнетения белых."
            },
            {
                "title": "23 сезон 7 серия: Настольные девочки",
                "url": "http://online-south-park.ru/season-23/374-23-sezon-7-serija-nastolnye-devochki.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-11/1574498452_1.jpg",
                "description": "Сильная Женщина участвует в женских спортивных соревнованиях. Её оппонентом становится здоровенный амбал, который считает себя женщиной. Разумеется, его (её?) нереально одолеть, но идти против этого спортсмена Сильная Женщина не может, ведь тогда она пойдёт против своих принципов.\nА тем временем в школе Южного Парка девочки начинают посещать клуб настольных игр, что становится ужасной новостью для Картмана."
            },
            {
                "title": "23 сезон 8 серия: Похитители дерьма",
                "url": "http://online-south-park.ru/season-23/375-23-sezon-8-serija-pohititeli-derma.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-12/1575546771_1.jpg",
                "description": "Уморительная серия с трэш-юмором в стиле середины 2000-х годов \"Южного парка\".\nВ результате кишечной инфекции у мамы Кайла пропали полезные бактерии в кишечнике. В больнице ей провели процедуру пересадки кала. Донорский кал стал панацеей, и вскоре здоровье у мамы Кайла стало даже лучше, чем до болезни. После этого некоторые жители города стали одержимы пересадкой здорового кала."
            },
            {
                "title": "23 сезон 9 серия: Базовый кабель",
                "url": "http://online-south-park.ru/season-23/376-23-sezon-9-serija-bazovyj-kabel.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-12/1575796824_1.jpg",
                "description": "А помните ли высобственный эпизод Баттерса? Так вот, это то же самое, только со Скоттом Малкинсоном, у которого диабет.\nСкотт давно мечтает, чтобы его отец подключил стриминговые сервисы для просмотра различных шоу, но тот работает на кабельную компанию и терпеть не может данные сервисы, которые убивают кабельное ТВ."
            },
            {
                "title": "23 сезон 10 серия: Рождественский снег",
                "url": "http://online-south-park.ru/season-23/377-23-sezon-10-serija-rozhdestvenskij-sneg.html",
                "img_url": "http://online-south-park.ru/uploads/posts/2019-12/1576418933_10.jpg",
                "description": "Предрождественская речь Санты портит весь кайф от приближающегося праздника, когда он призывает людей не пить на Рождество. Разумеется, жители города не слушают и в рождественскую ночь устраивают настоящую вахканалию на улицах города. На следующий день выясняется, что в городе действует запрет на продажу алкоголя на время праздничных дней."
            }
        ],
        "number_of_episodes": 10
    }
]