[
    {
        "text": "Уверен, что это правильно.",
        "expected": "male"
    },
    {
        "text": "Я не согласна с тем, чтобы...\nОднако, подумала, что ...",
        "expected": "female"
    },
    {
        "text": "Вторая гифка, кстати, отлично вписывается в стандартную механику игры. Я в первой части не одного врага таким методом убил.",
        "expected": "male"
    },
    {
        "text": "Вторая гифка, кстати, отлично вписывается в стандартную механику игры. Я в первой части не одного врага таким методом убила.",
        "expected": "female"
    },
    {
        "text": "Ты запарил меня уже. Я твой рейтинг вообще не трогал.",
        "expected": "male"
    },
    {
        "text": "Ты запарил меня уже. Я твой рейтинг вообще не трогала.",
        "expected": "female"
    },
    {
        "text": "Я бы не стал со 100% уверенностью утверждать, что это последняя игра Фромов с такой механикой, НО, стоит отдать должное, в 3-ей части они таки поставили ЖИРНЕЙШУЮ точку в истории, начатой в ДС1.",
        "expected": "male"
    },
    {
        "text": "Я бы не стала со 100% уверенностью утверждать, что это последняя игра Фромов с такой механикой, НО, стоит отдать должное, в 3-ей части они таки поставили ЖИРНЕЙШУЮ точку в истории, начатой в ДС1.",
        "expected": "female"
    },
    {
        "text": "В этой части не было, недаром же я написал «что все...».",
        "expected": "male"
    },
    {
        "text": "В этой части не было, недаром же я написала «что все...».",
        "expected": "female"
    },
    {
        "text": "Сил ждать все меньше. Целая неделя впереди. Но хорошо, что все игру оценивают очень высоко и разочарования уже точно не будет.\nP.S. И я был бы не против продолжения souls-игр, а очень даже за.",
        "expected": "male"
    },
    {
        "text": "Сил ждать все меньше. Целая неделя впереди. Но хорошо, что все игру оценивают очень высоко и разочарования уже точно не будет.\nP.S. И я была бы не против продолжения souls-игр, а очень даже за.",
        "expected": "female"
    },
    {
        "text": "Зашел почитать комменты на ютубе, испортил себе настроение",
        "expected": "male"
    },
    {
        "text": "Товарищи, я не понял русская версия душ вышла раньше времени? она же 12 выходит?",
        "expected": "male"
    },
    {
        "text": "а это нормально что у меня вместо пропускаемой игровой рекламы как обычно, перед роликом была не пропускаемая реклама средства от насморка?",
        "expected": "neut"
    },
    {
        "text": "Прошел с удовольствием 1 Фоллаут и 2 Вейстленд. 2 фоллаут мне надоел после атомной станции, т.к. слишком много дичи и смехуечков засунули, по сравнению с 1 частью. АТОМ РПГ, прошел с огромным удовольствием и эта игра мне понравилась куда больше, чем те на которые она опиралась. Отличная работа и весьма достойна.",
        "expected": "male"
    },
    {
        "text": "Прошел с удовольствием 1 Фоллаут и 2 Вейстленд.",
        "expected": "male"
    },
    {
        "text": "Обалденная мексиканская кесадилья))рецепт такого типа давно искала, спасибо!!",
        "expected": "female"
    },
    {
        "text": "Мне только 9 лет и я приготовила этот борщ. Получилось очень вкусно.",
        "expected": "female"
    },
    {
        "text": "Варила в первый раз и борщ получился очень вкусным) Спасибо!)",
        "expected": "female"
    },
    {
        "text": "Борщ получился нормальный, но из-за того, что говядина, какой-то слабенький. Не слышно вкус мяса в бульоне. И абсолютно не жирный (что полезно, но хотелось бы понаваристее). Я еще для вкуса добавила чеснок.",
        "expected": "female"
    },
    {
        "text": "Спасибо большое за рецепт.Получилось вкусно.Особенно если ещё с жареным хлебом и чесноком,то ооочень аппетитно",
        "expected": "neut"
    },
    {
        "text": "Вместо томатной пасты добавила перетертые помидоры, и варила овощи чуть дольше . Вкусно получилось",
        "expected": "female"
    },
    {
        "text": "Жаль что не написали, что мясо лучше после варки вытащить и по резать мелко(срезать жирки, хотя об этом вообще ни в одном рецепте не пишут), для первого опыта получилось крупновато. Картофель действительно у всех по размерам разный)) свеклу потушила отдельно в сковороде в бульоне. За рецепт спасибо! Вкусно!",
        "expected": "female"
    },
    {
        "text": "Борщ получился нереально вкусный! Готовила в первый раз в жизни именно по вашему рецепту! Утёрла свекрови нос)). У неё всегда он полупрозрачный, хлипенький такой. А у меня получился очень наваристый и цвет был обалденный, как надо! Муж визжал от восторга! Спасибо!",
        "expected": "female"
    },
    {
        "text": "Мой любимый Борщ! Спасибо вам , очень вкусно! Мужу нравится! Готовила первый раз по этому рецепту , и только по нему буду готовить!",
        "expected": "female"
    },
    {
        "text": "В конце зажарки добавила чеснок,запах придал оболденный,а так все по рецепту сделала и очень вкусно.а и не добавляла уксус",
        "expected": "female"
    },
    {
        "text": "Приготовила по вашему рецепту. Мужу очень понравилось. Мы только недавно начали жить вместе и благодаря вашем рецептом я угодила свекрови мужу. Спасибо вам огромное.",
        "expected": "female"
    },
    {
        "text": "Безумно вкусный борщ получился! Спасибо большое за рецепт!!! Единственное что изменила - свеклу натерла на крупной терке.\nспасибо!",
        "expected": "female"
    },
    {
        "text": "Приготовила по вашему рецепту. Как раз в этот день к мужу друзья заходили, всех пришлось кормить борщем. Теперь каждый раз, приходя к нам в гости, они делаю глаза как у кота из Шрека и с надеждой спрашивают \"Нет ли того божественного борщичка\"))) Спасибо за рецепт)",
        "expected": "female"
    },
    {
        "text": "Брала 2 литра воды, этого не хватило, пришлось доливать потом еще и порядочно, иначе супом это сложно назвать) Вышло вкусно",
        "expected": "female"
    }
]