#!/usr/bin/env python3
# -*- coding: utf-8 -*-

__author__ = 'ipetrash'


import time

import requests
from bs4 import BeautifulSoup

session = requests.session()
session.headers['User-Agent'] = 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:44.0) Gecko/20100101 Firefox/44.0'

words = []

for page in range(1, 94+1):
    if page == 1:
        url = 'https://synonymonline.ru/%D0%A0'
    else:
        url = f'https://synonymonline.ru/%D0%A0?page={page}'

    rs = session.get(url)
    root = BeautifulSoup(rs.content, 'html.parser')

    for a in root.select('ul.words-list > li > a'):
        word = a.text.lower()
        if word.startswith('ре') and word.endswith('р'):
            words.append(word)

    time.sleep(0.3)

print(words)
# ['реактор', 'реакционер', 'реальгар', 'реаниматор', 'ребризер', 'реверсер',
#  'реверсор', 'ревизор', 'револьвер', 'революционер', 'регар', 'регенератор',
#  'регистр', 'регистратор', 'регулятор', 'регур', 'ред-ривер', 'редактор',
#  'редуктор', 'реестр', 'режиссер', 'резервуар', 'резистер', 'резистивиметр',
#  'резистор', 'резонатор', 'резонер', 'резус-фактор', 'рейбер', 'рейбор',
#  'рейвер', 'рейдер', 'рейнджер', 'рейнир', 'рейсфедер', 'рейтар', 'рейтер',
#  'рейхсвер', 'рейхсканцлер', 'рекетер', 'рекетмейстер', 'реклаймер',
#  'реконструктор', 'рекордер', 'рекрутер', 'ректификатор', 'ректор', 'рекуператор',
#  'релаксатор', 'рельсотранспортер', 'реляксатор', 'ремер', 'ремитер', 'ремонтер',
#  'рентгенгенератор', 'рентгенгониометр', 'рентгенметр', 'рентгеноанализатор',
#  'рентгеногониометр', 'рентгенометр', 'рентгеноспектр', 'рентгеноспектрометр',
#  'рентгеностереометр', 'рентгенотелевизор', 'рентгенофотометр', 'реоанализатор',
#  'реолавер', 'реометр', 'реомонитор', 'реомюр', 'реопирометр', 'реорганизатор',
#  'репеллер', 'репер', 'репертуар', 'реперфоратор', 'репетир', 'репетитор',
#  'репитер', 'репитор', 'репортер', 'репрессор', 'репродуктор', 'репшнур',
#  'ресивер', 'рессивер', 'реставратор', 'ресторатор', 'ретардер', 'ретинопротектор',
#  'ретранслятор', 'ретровир', 'ретур', 'ретушер', 'рефлектомер', 'рефлектометр',
#  'рефлектор', 'реформатор', 'рефрактомер', 'рефрактометр', 'рефрактор',
#  'рефрижератор', 'рефулер', 'рецептор', 'решофер']
