#!/usr/bin/env python3
# -*- coding: utf-8 -*-

__author__ = 'ipetrash'


from common import get_html, process_td
html = get_html()

from bs4 import BeautifulSoup
root = BeautifulSoup(html, 'html.parser')

# Таблица "Награды Пиратов Соломенной Шляпы"
table = root.select('.wikitable')[0]

# Список строк исключая строку заголовка
row_list = table.select('tr')[1:]

row = 1

for i in range(0, len(row_list), 2):
    row_1 = row_list[i]
    print(row, [process_td(td) for td in row_1.select('td')])
    row += 1

# RESULT:
# 1 ['Монки Д. Луффи', '«Соломенная Шляпа» / «Пятый Император»', '1 500 000 000']
# 2 ['Ророноа Зоро', '«Охотник на пиратов»', '320 000 000']
# 3 ['Нами', '«Кошка воровка»', '66 000 000']
# 4 ['Усопп', '«Согекинг» / «Бог»', '200 000 000']
# 5 ['Винсмок Санджи', '«Черная нога»', '330 000 000']
# 6 ['Тони Тони Чоппер', '«Любитель сахарной ваты»', '100']
# 7 ['Нико Робин', '«Дитя дьявола»', '130 000 000']
# 8 ['Фрэнки', '«Киборг»', '94 000 000']
# 9 ['Брук', '«Напевающий» / «Соул Кинг»', '83 000 000']
# 10 ['Дзимбэй', '«Рыцарь Моря»', 'Более 400 000 000']
